{
  "steles": [
    {
      "id": "kai_001",
      "name": "九成宫醴泉铭",
      "aliases": [
        "九成宫醴泉铭"
      ],
      "script_type": "楷书",
      "author": "欧阳询",
      "dynasty": "唐",
      "year": "632年",
      "type": "碑刻",
      "location": "陕西麟游",
      "total_chars": 1366,
      "content": "九成宫醴泉铭。秘书监检校侍中巨鹿郡公臣魏徵奉敕撰，率更令兼太子率更令勃海男臣欧阳询奉敕书。维贞观六年孟夏之月，皇帝避暑乎九成宫，此则隋之仁寿宫也。冠山抗殿，绝壑为池，跨水架楹，分岩耸阙，高阁周建，长廊四起，栋宇胶葛，台榭参差。仰视则迢递百寻，下临则峥嵘千仞，珠璧交映，金碧相晖，照灼云霞，蔽亏日月。观其移山回涧，穷泰极侈，以人从欲，良足深尤。至于炎景流金，无郁蒸之气，微风徐动，有凄清之凉，信安体之佳所，诚养神之胜地，汉之甘泉不能尚也。皇帝爰在弱冠，经营四方，逮乎立年，抚临亿兆，始以武功壹海内，终以文德怀远人。东越青丘，南逾丹徼，皆献琛奉贽，重译来王，西暨轮台，北拒玄阙，并地列州县，人充编户。气淑年和，迩安远肃，群生咸遂，灵贶毕臻，虽藉二仪之功，终资一人之虑。遗身利物，栉风沐雨，百姓为心，忧劳成疾，同尧肌之如腊，甚禹足之胼胝，针石屡加，腠理犹滞。爰居京室，每弊炎暑，群下请建离宫，庶可怡神养性。圣上爱一夫之力，惜十家之产，深闭固拒，未肯俯从。以为隋氏旧宫，营于曩代，弃之则可惜，毁之则重劳，事贵因循，何必改作。于是斫雕为朴，损之又损，去其泰甚，葺其颓坏，杂丹墀以沙砾，间粉壁以涂泥，玉砌接于土阶，茅茨续于琼室。仰观壮丽，可作鉴于既往，俯察卑俭，足垂训于后昆。此所谓至人无为，大圣不作，彼竭其力，我享其功者也。然昔之池沼，咸引谷涧，宫城之内，本乏水源，求而无之，在乎一物，既非人力所致，圣心怀之不忘。粤以四月甲申朔旬有六日己亥，上及中宫，历览台观，闲步西城之阴，踌躇高阁之下，俯察厥土，微觉有润，因而以杖导之，有泉随而涌出，乃承以石槛，引为一渠。其清若镜，味甘如醴，南注丹霄之右，东流度于双阙，贯穿青琐，萦带紫房，激扬清波，涤荡瑕秽，可以导养正性，可以澄莹心神。鉴映群形，润生万物，同湛恩之不竭，将玄泽于常流，匪唯乾象之精，盖亦坤灵之宝。谨案：《礼纬》云：王者刑杀当罪，赏锡当功，得礼之宜，则醴泉出于阙庭。《鹖冠子》曰：圣人之德，上及太清，下及太宁，中及万灵，则醴泉出。《瑞应图》曰：王者纯和，饮食不贡献，则醴泉出，饮之令人寿。《东观汉记》曰：光武中元元年，醴泉出京师，饮之者痼疾皆愈。然则神物之来，寔扶明圣，既可蠲兹沉痼，又将延彼遐龄。是以百辟卿士，相趋动色，我后固怀撝挹，推而弗有，虽休勿休，不徒闻于往昔，以祥为惧，实取验于当今。斯乃上帝玄符，天子令德，岂臣之末学所能丕显。但职在记言，属兹书事，不可使国之盛美，有遗典策，敢陈实录，爰勒斯铭。其词曰：唯皇抚运，奄壹寰宇，千载膺期，万物斯睹，功高大舜，勋深伯禹，绝后承前，登三迈五。握机蹈距，乃圣乃神，武克祸乱，文怀远人，书契未纪，开辟不臣，冠冕并袭，琛贽咸陈。大道无名，上德不德，玄功潜运，几深莫测，凿井而饮，耕田而食，靡谢天功，安知帝力。上天之载，无臭无声，万类资始，品物流形，随感变质，应德效灵，介焉如响，赫赫明明。杂遝景福，葳蕤繁祉，云氏龙官，龟图凤纪，日含五色，乌呈三趾，颂不辍工，笔无停史。上善降祥，上智斯悦，流谦润下，潺湲皎洁，萍旨醴甘，冰凝镜澈，用之日新，挹之无竭。道随时泰，庆与泉流，我后夕惕，虽休弗休，居崇茅宇，乐不般游，黄屋非贵，天下为忧。人玩其华，我取其实，还淳反本，代文以质，居高思坠，持满戒溢，念兹在兹，永保贞吉。兼太子率更令渤海男臣欧阳询奉敕书。",
      "description": "唐楷书代表作，由欧阳询书写。"
    },
    {
      "id": "kai_002",
      "name": "化度寺碑",
      "aliases": [
        "化度寺碑"
      ],
      "script_type": "楷书",
      "author": "欧阳询",
      "dynasty": "唐",
      "year": "632年",
      "type": "碑刻",
      "location": "陕西西安",
      "total_chars": 955,
      "content": "化度寺故僧邕禅师舍利塔铭。右庶子李百药撰，率更令欧阳询书。盖闻人灵之贵，天众攸凭，禀仁义之和，感山川之秀，穷理尽性，通幽洞微。故知翾飞蠕动，皆有灵性，况我天人之广，符度之尊，其生也万物备其形，其成也三光降其精，岂可忽哉。粤若稽古，圣神迭兴，玄化潜运，至道虚寂，有国之主，莫不虔心归向，崇树福田，宏济群生，咸登觉路。故能使金容照曜，玉毫舒光，法雨流慈，惠风扇善，阐扬幽奥，显契宗极。其有大心海量，独悟真如，深达因缘，无生理外，志存弘道，心重忘身，能于生死海中，为诸众生作归依处，则我禅师其人也。禅师讳邕，俗姓郭氏，太原介休人也。昔有周氏，积德累仁，受图命氏，封建茅土，分星辨野，世禄相继，贤才间出。祖宪，齐凉州刺史，敦仁博洽，标誉乡间。父慎，隋恒州长史，俶傥英雄，声驰河济。禅师禀气中和，含灵独秀，器宇宏深，风神贞简，体备文用，才周物务。幼而悟入，长乃精通，早厌尘劳，栖心物表。年甫十五，出家受具，游方问道，远适京洛，博采真宗，穷研秘藏。故能心游定慧，志入虚空，解深密之幽微，穷瑜伽之奥赜。逮乎隋运将倾，中原丧乱，群生苦毒，四民涂炭，乃怀济世之念，思弘利物之功。于是振锡江都，随缘化导，拯斯民于涂炭，安反侧于惊波。及大业末年，天下沸腾，乃避地于钟山，栖迟林野，披榛采兰，饮泉茹芝，枕石漱流，逍遥自得。逮皇唐启运，率土更新，化渐区中，威加海外。乃于武德之始，返迹旧乡，卜居兹岭，创建精舍，名曰化度。因山为基，就岩起宇，飞阁流丹，崇台耸翠，烟霞为之错杂，松竹与之交映。于是四方学侣，负笈来游，云屯雾集，千有余人。禅师以大乘为心，小乘为迹，定慧双运，戒忍俱修，讲肆宣阐，法轮常转，故能化行帝里，道被王城，德动天心，名高物表。加以慈仁乐施，救苦为怀，饥者食之，寒者衣之，病者疗之，忧者慰之，故能使远近归心，遐迩禀化。贞观五年十一月十六日，终于本寺，春秋六十有九。道俗号恸，如丧考妣。粤以其月廿八日，葬于寺之北原。起塔树碑，以旌玄德。其铭曰：至道虚寂，妙绝名言，去来无迹，出没无缘。爱有至人，独悟斯玄，心游法海，志入空门。舍兹爱取，离彼尘樊，超然独处，邈矣高骞。福兼人天，行该因果，定慧双运，戒忍俱固。化被帝京，道光江左，德动天心，名高物表。方冀遐龄，永弘斯道，如何厄运，奄从物化。道俗同悲，人天号慕，建兹灵塔，式扬清誉。",
      "description": "唐楷书代表作，由欧阳询书写。"
    },
    {
      "id": "kai_004",
      "name": "颜氏家庙碑",
      "aliases": [
        "颜氏家庙碑"
      ],
      "script_type": "楷书",
      "author": "颜真卿",
      "dynasty": "唐",
      "year": "780年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 590,
      "content": "唐故通议大夫行薛王友柱国赠秘书少监国子祭酒太子少保颜君庙碑铭并序。第七子光禄大夫行吏部尚书充礼仪使上柱国鲁郡公真卿撰并书。昔孔悝有夷鼎之铭，陆机有祠堂之颂，皆所以发挥祖德，昭前人之光也。我家以儒雅传业，世载清德，迄于今而益盛。故追述先烈，敢备刻于金石，以垂不朽。君讳惟贞，字叔坚，其先出于颛顼之孙祝融。融孙安为曹姓，其裔邾武公名夷甫，字颜，子孙因以为氏。多仕鲁，为卿大夫。孔门达者七十二人，颜氏有八。战国有率烛、烛孙秦有芝贞，汉有异肆、肆孙钦，钦从祖沛国相盛，始居长安，盛裔孙御。御有孙腾，腾有孙盛，盛有名乐，乐有名猷，猷有名师古，师古有名相时，相时有名育德，育德有名允南、允南有名乔卿，乔卿有名真长，真长有名幼舆，幼舆有名勤礼，勤礼有名昭甫，昭甫有名元孙，元孙有名惟贞。君即惟贞也。君幼而颖悟，早有令名。工于篆籀，尤善楷隶。解褐校书郎，历薛王友。以开元二十七年十一月薨于京师，春秋六十有七。以天宝元年十月葬于万年县凤栖原。长子春卿，早卒。次子杲卿，尝为常山太守，赠太子太保。三子旭卿，尝为莒县尉，赠太子太保。四子茂曾，尝为郫县令，赠太子少保。五子缺。六子幼舆，尝为太子洗马，赠太子少保。君以子贵，累赠秘书少监、国子祭酒、太子少保。真卿不佞，忝继家声，夙夜兢兢，不敢失坠。敢刻金石，以纪祖德。其铭曰：於穆我祖，世载清芬。传业儒雅，积庆斯文。真卿拜手，敢昭前人。刻此贞石，垂裕后昆。",
      "description": "唐楷书代表作，由颜真卿书写。"
    },
    {
      "id": "kai_005",
      "name": "颜勤礼碑",
      "aliases": [
        "颜勤礼碑"
      ],
      "script_type": "楷书",
      "author": "颜真卿",
      "dynasty": "唐",
      "year": "大历十四年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 1343,
      "content": "唐故秘书省著作郎夔州都督府长史上护军颜君神道碑。曾孙鲁郡公真卿撰并书。君讳勤礼，字敬，琅琊临沂人也。高祖讳见远，齐御史中丞，梁武帝受禅，不食数日，一恸而绝，事见梁书。曾祖讳协，梁湘东王记室参军，文苑有传。祖讳之推，北齐给事黄门侍郎，隋东宫学士，齐书有传。父讳思鲁，博学善属文，尤工诂训，仕隋司经校书、东宫学士，率更令欧阳询见而叹曰：秘书自有英主，因此遂名。太宗为秦王，太宗初为秦王，使持节陇右诸州都督陇右诸州都督陇西道大使，公为府文学，掌记室，又侍读皇孙，每蒙厚赏，及践祚，拜著作郎，加崇贤馆学士，武德二年见素鬓旧德，令总修仪注，封武德县男，时年六十七。七代祖讳之仪，周御正御史中大夫，以德行称于天下，与周武帝同受业于露门学。五代祖讳之善，隋秘书监，领著作，撰隋书；兄弟见北史。六代祖讳之推，北齐黄门郎，修文殿学士，撰家训二十篇，见北齐书。曾伯祖讳师古，唐秘书监，刊正经籍，其学海内宗仰。曾祖姑讳真卿，嫁柳氏，子奭，相高宗。君幼而朗晤，识量宏远，工于篆籀，尤精诂训，解褐校书郎，授将仕郎，除著作佐郎，迁右率府铠曹参军，出为雍州司士参军，转安西大都护府录事参军，授上骑都尉。武德元年十一月，从太宗平京城，授仪同三司，除秘书省著作郎。贞观三年，兼修国史。六年，除太子率更丞。七年，除谷州别驾，改著作郎，又兼修国史，迁驾部员外郎，出为齐王府司马。十二年，除蕲州刺史。十四年，除滑州刺史。十六年，除醴泉县令。十八年，除房州刺史。二十年，除益州都督府长史。永徽元年，除秘书少监，加银青光禄大夫。三年，除定襄都督，充安抚大使，加金紫光禄大夫，上柱国。六年，除崇贤馆学士，检校著作郎。显庆元年，迁夔州都督府长史，加大将军，封琅琊县公。三年，以年老致仕。四年，薨于京师，春秋八十有九。赠使持节夔州都督，谥曰康。君以书法之妙，名闻天下，尤以楷书见长，师法二王，自成一家，与欧阳询、褚遂良、薛稷并称初唐四大家。其书端庄雄伟，气势开张，为后世所称道。君性好学，博览群书，尤精史学，曾预修晋书、梁书、陈书、北齐书、周书、隋书等正史，为一代名臣。有子元孙，举进士，考功员外郎，撰韵海镜源三百六十卷，开元中奉上，今藏内府。次子惟贞，曾任薛王友，赠太子少保。惟贞子阙疑，杭州参军，号小颜。允南，滁州刺史。乔卿，富阳令。真卿，平原太守，赠太子太师，封鲁郡公。允臧，大理正，兼侍御史，金吾将军，赠尚书左仆射。并以文学政事，显名于世。有孙泉明，历常山太守，太子舍人，赠秘书监。温之，历华阴丞，赠工部尚书。君之先德，世以儒术显，至君尤著。君以永徽三年薨，葬于万年县凤栖原。曾孙真卿，蒙恩授湖州刺史，以亲累贬蓬州长史，移吉州司马，起为抚州刺史，除兵部侍郎，河北采访招讨使，迁吏部侍郎，除同州、蒲州二刺史，入为刑部尚书，充礼仪使，充东都留守，除怀州刺史，除华州刺史，除湖州刺史，移昇州刺史，除江西节度使，迁刑部尚书，太子太师，鲁郡公。真卿以罪臣之后，蒙累朝之恩，忝窃高位，惭无报称。今为君立碑，以纪先德，庶几不泯于后世。其铭曰：琅琊世族，累叶清华。代传儒素，门多相车。惟君挺生，才美纷葩。学该坟史，艺总书画。解褐登朝，清尘自远。历职中外，声华益显。晚节弥坚，风霜益鲜。享年八十，五福俱全。归葬于原，松柏森然。式昭令德，永播芳弦。",
      "description": "唐楷书代表作，由颜真卿书写。"
    },
    {
      "id": "kai_006",
      "name": "多宝塔碑",
      "aliases": [
        "多宝塔碑"
      ],
      "script_type": "楷书",
      "author": "颜真卿",
      "dynasty": "唐",
      "year": "天宝十一年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 2478,
      "content": "大唐西京千福寺多宝佛塔感应碑文。南阳岑勋撰，朝议郎、判尚书、武部员外郎、琅邪颜真卿书。朝散大夫、检校尚书、都官郎中、东海徐浩题额。粤，《妙法莲华》，诸佛之秘藏也；多宝佛塔，证经之踊现也。发明资乎十力，弘建在于四依。有禅师法号楚金，姓程，广平人也。祖、父并信著释门，庆归法胤。母高氏，久而无妊，夜梦诸佛，觉而有娠。是生龙象之征，无取熊罴之兆。诞弥厥月，炳然殊相。歧嶷绝于荤茹，髫龀不为童游。道树萌牙，耸豫章之桢干；禅池畎浍，涵巨海之波涛。年甫七岁，居然厌俗，自誓出家。礼藏探经，《法华》在手。宿命潜悟，如识金环；总持不遗，若注瓶水。九岁落发，住西京龙兴寺，从僧箓也。进具之年，升座讲法。顿收珍藏，异穷子之疾走；直诣宝山，无化城而可息。尔后因静夜持诵，至《多宝塔品》，身心泊然，如入禅定，忽见宝塔，宛在目前，释迦分身，遍满空界。行勤圣现，业净感深，悲生悟中，泪下如雨。遂布衣一食，不出户庭，期满六年，誓建兹塔。既而许王瓘及居士赵崇、信女普意，善来稽首，咸舍珍财。禅师以为辑庄严之因，资爽垲之地，利见千福，默议于心。时千福有怀忍禅师，忽于中夜，见有一水，发源龙兴，流注千福，清澄泛滟，中有方舟。又见宝塔，自空而下，久之乃灭，即今建塔处也。寺内净人，名法相，先于其地复见灯光，远望则明，近寻即灭。窃以水流开于法性，舟泛表于慈航，塔现兆于有成，灯明示于无尽，非至德精感，其孰能与于此？及禅师建言，杂然欢惬，负畚荷插，于櫜于囊，登登凭凭，是板是筑。洒以香水，隐以金锤。我能竭诚，工乃用壮。禅师每夜于筑阶所，恳志诵经，励精行道，众闻天乐，咸嗅异香，喜叹之音，圣凡相半。至天宝元载，创构材木，肇安相轮。禅师理会佛心，感通帝梦。七月十三日，敕内侍赵思侃，求诸宝坊，验以所梦。入寺见塔，礼问禅师，圣梦有孚，法名惟肖。其日赐钱五十万，绢千匹，助建修也。则知精一之行，虽先天而不违；纯如之心，当后佛之授记。昔汉明永平之日，大化初流；我皇天宝之年，宝塔斯建。同符千古，昭有烈光。于时道俗景附，檀施山积，庀徒度财，功百其倍矣。至二载，敕中使杨顺景宣旨，令禅师于花萼楼下迎多宝塔额。遂总僧事，备法仪。宸眷俯临，额书下降，又赐绢百匹。圣札飞毫，动云龙之气象，天文挂塔，驻日月之光辉。至四载，塔事将就，表请庆斋，归功帝力。时僧道四部，会逾万人，有五色云团辅塔顶，众尽瞻睹，莫不崩悦。大哉！观佛之光，利用宾于法王。禅师谓同学曰：鹏运沧溟，非云罗之可顿；心游寂灭，岂爱网之能加？精进法门，菩萨以自强不息。本期同行，复遂宿心。凿井见泥，去水不远；钻木未热，得火何阶。凡我七僧，聿怀一志，昼夜塔下诵持《法华》，香烟不断，经声递续，炯以为常，没身不替。自三载，每春秋二时，集同行大德四十九人，行法华三昧。寻奉恩旨，许为恒式。前后道场，所感舍利凡三千七十粒。至六载，欲葬舍利，预严道场，又降一百八粒。画普贤变，于笔锋上，联得一十九粒，莫不圆体自动，浮光莹然。禅师无我观身、了空求法，先刺血写《法华经》一部、《菩萨戒》一卷、《观普贤行经》一卷，乃取舍利三千粒，盛以石函，兼造自身石影，跪而戴之，同置塔下，表至敬也。使夫舟迁夜壑，无变度门。劫算墨尘，永垂贞范。又奉为主上及苍生写《妙法莲华经》一千部，金字三十六部，用镇宝塔。又写一千部，散施受持。灵应既多，具如本传。其载，敕内侍吴怀实，赐金铜香炉，高一丈五尺。奉表陈谢，手诏批云：师弘济之愿，感达人天，庄严之心，义成因果，则法施、财施，信所宜先也。主上握至道之灵符，受如来之法印，非禅师大慧超悟，无以感于宸衷；非主上至圣文明，无以鉴于诚愿。倬彼宝塔，为章梵宫，经始之功，真僧是葺，克成之业，圣主斯崇。尔其为状也，则岳耸莲披，云垂盖偃，下欻崛以踊地，上亭盈而媚空，中晻晻其静深，旁赫赫以弘敞。礝磩承陛，琅玕綷槛，玉瑱居楹，银黄拂户，重檐叠于画栱，反宇环其璧珰。坤灵赑屃以负砌，天祇俨雅而翊户。或复肩挚鸟，肘擐修蛇，冠盘巨龙，帽抱猛兽，勃如战色，有奭其容，穷绘事之笔精，选朝英之偈赞。若乃开扃鐍，窥奥秘。二尊分座，疑对鹫山；千帙发题，若观龙藏。金碧炅晃，环珮葳蕤。至于列三乘，分八部，圣徒翕习，佛事森罗。方寸千名，盈尺万象。大身现小，广座能卑。须弥之容，欻入芥子；宝盖之状，顿覆三千。昔衡岳思大禅师，以法华三昧，传悟天台智者，尔来寂寥，罕契真要。法不可以久废，生我禅师，克嗣其业，继明二祖，相望百年。夫其法华之教也，开玄关于一念，照圆镜于十方，指阴界为妙门，驱尘劳为法侣；聚沙能成佛道，合掌已入圣流。三乘教门，总而归一，八万法藏，我为最雄。譬尤满月丽天，萤光列宿；山王映海，蚁垤群峰。嗟呼，三界之沉寂久矣，佛以法华为木铎，惟我禅师，超然深悟。其貌也，岳渎之秀，冰雪之姿，果唇贝齿，莲目月面。望之厉，即之温，睹相未言，而降伏之心已过半矣。同行禅师抱玉、飞锡，袭衡台之秘躅，传止观之精义。或名高帝选，或行密众师，共弘开示之宗，尽契圆常之理。门人苾萏、如岩、灵悟、净真、真空、法济等，以定慧为文质，以戒忍为刚柔，含朴玉之光辉，等旃檀之围绕。夫发行者因，因圆则福广；起因者相，相遣则慧深。求无为于有为，通解脱于文字。举事征理，含毫强名。偈曰：佛有妙法，比象莲华，圆顿深入，真净无暇，慧通法界，福利恒沙，直至宝所，俱乘大车。其一，于戏上士，发行正勤，缅想宝塔，思弘胜因，圆阶已就，层覆初陈，乃昭帝梦，福应天人。其二，轮奂斯崇，为章净域，真僧草创，圣主增饰，中座眈眈，飞檐翼翼，荐臻灵感，归我帝力。其三，念彼后学，心滞迷封，昏衢未晓，中道难逢，常惊夜杌，还惧真龙，不有禅伯，谁明大宗。其四，大海吞流，崇山纳壤，教门称顿，慈力能广，功起聚沙，德成合掌，开佛知见，法为无上。其五，情尘虽杂，性海无漏，定养圣胎，染生迷鷇，断常起缚，空色同谬，薝蔔现前，余香何嗅。其六，彤彤法宇，繄我四依，事该理畅，玉粹金辉，慧镜无垢，慈灯照微，空王可托，本愿同归。其七，天宝十一载，岁次壬辰，四月乙丑朔，廿二日戊戌建。敕捡校塔使、正议大夫、行内侍赵思侃、判官内府丞车冲。捡校僧义方。河南史华刻。",
      "description": "唐楷书代表作，由颜真卿书写。"
    },
    {
      "id": "kai_007",
      "name": "柳公权玄秘塔碑",
      "aliases": [
        "柳公权玄秘塔碑"
      ],
      "script_type": "楷书",
      "author": "柳公权",
      "dynasty": "唐",
      "year": "会昌元年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 590,
      "content": "唐故左街僧录、内供奉、三教谈论、引驾大德、安国寺上座、赐紫、大达法师玄秘塔碑铭并序。江南西道都团练、观察处置等使，朝散大夫、检校左散骑常侍兼洪州刺史、御史中丞、上柱国、赐紫金鱼袋裴休撰。正议大夫、守右散骑常侍、充集贤殿学士、判院事、上柱国、河东县开国伯、食邑七百户、赐紫金鱼袋柳公权书。集贤直院官、朝议郎、守衡州长史、上柱国徐方平篆额。玄秘塔者，大法师端甫灵骨之所归也。法师讳端甫，俗姓赵氏，京兆华原人也。大历三年，诏为国师，赐以衣冠。法师幼而聪悟，长博通经论，演畅毗尼，光阐戒法。每升座讲论，听者填塞。尝于宫中为代宗皇帝说法，帝嘉之，赐号大历国师。德宗皇帝即位，尤加崇奉，常从受戒法，赐号大历国师，兼领左街僧事。顺宗皇帝在春宫时，亦从受戒法。宪宗皇帝每延入宫中，与论佛法，赐号大达法师。法师以大乘为心，小乘为迹，显密双通，戒慧并运。自代宗至宪宗，历事五帝，皆在禁中，为国大法师。元和五年十一月，终于安国寺，寿七十。皇帝哀悼，辍朝一日，赐绢二百匹，钱五十万，令中使护葬。以其月十八日，葬于长安城南樊川北原，建塔于玄秘塔。法师之道，上以翊赞皇猷，下以弘宣佛教，内以修持戒律，外以化导群生。其德行为当时所重，其书法为后世所宗。门人弟子，相与立碑，以纪其德。其铭曰：法师道高，帝者之师，历侍五帝，阐扬佛规。戒定慧学，三学并驰，显密圆通，无偏无私。元和示灭，塔起樊川，玄秘之名，永播万年。",
      "description": "唐楷书代表作，由柳公权书写。"
    },
    {
      "id": "kai_008",
      "name": "神策军碑",
      "aliases": [
        "神策军碑"
      ],
      "script_type": "楷书",
      "author": "柳公权",
      "dynasty": "唐",
      "year": "会昌三年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 882,
      "content": "皇帝巡幸左神策军纪圣德碑并序。翰林学士承旨、朝议郎、守尚书司封郎中、知制诰、上柱国、赐紫金鱼袋臣崔铉奉敕撰。正议大夫、守右散骑常侍、充集贤殿学士、判院事、上柱国、河东县开国伯、食邑七百户、赐紫金鱼袋臣柳公权奉敕书。集贤直院官、朝议郎、守衡州长史、上柱国臣徐方平奉敕篆额。我国家诞受天命，奄宅区夏，二百廿有余载。列圣相承，重熙累洽。逮于十五叶，运属中兴。仁圣文武至神大孝皇帝温恭濬哲，齐圣广泉。会天地之昌期，集讴歌于颍邸。由至公而光符历试，逾五让而绍登宝图。握金镜以调四时，抚璇玑而齐七政。蛮貊率俾，神祇眷怀。即位之初，惟新霈泽，昭苏品汇。序劝贤能，祗畏劳谦，动遵法度。竭孝思于昭配，尽哀敬于园陵。风雨小愆，虔心以申乎祈禱；虫螟未息，辍食以轸乎黎元。发挥典谟，兴起法度。敦叙九族，咸秩无文。舟车之所通，日月之所照，莫不涵泳至德，被沐皇风。欣欣然，陶陶然，不知其俗之臻于富寿矣。是以年谷顺成，灾沴不作。惠泽施于有截，声教溢于无垠。粤以明年之正月，享玄元，谒清庙。爰申报本之义，遂有事于圆丘。展帝容，备法驾。组练云布，羽卫星陈。俨翠华之葳蕤，森朱干之格泽。盥荐斋栗，奠拜恭寅。故得二仪垂休，百灵受职。有感斯应，无幽不通。大辂鸣銮，则雪清禁道；泰坛紫燎，则气霁寒郊。非烟氤氲，休徵杂沓。既而六龙回辔，万骑还宫。临端门，敷大号。行庆颁赏，宥罪录功。究刑政之源，明教化之本。考臧否于群吏，问疾苦于蒸人。绝兼并之流，修水旱之备。百辟兢庄以就位，万国奔走而来庭。搢绅带鹖之伦，毡裘椎髻之俗，莫不解辫蹶角，蹈德咏仁，抃舞康庄，尽以为遭逢尧年舜日矣。皇帝惕然自思，退而谓群臣曰：历观三五已降致理之君，何常不满招损，谦受益，崇太素，乐无为，宗易简以临人，保慈俭以育物。土阶茅屋，则大之美是崇；抵璧捐金，不贪之宝斯著。顾惟荷祖宗之丕构，属寰宇之甫宁，思欲追踪太古之遐风，缅慕前圣之令范。乃下明诏，发德音，损乘舆之服御，却贡献之珍奇，罢不急之官，省无名之费。以今之尺地寸土，皆祖宗之旧；一民一物，皆祖宗之遗。朕不敢自私，与天下共之。于是天下之士，咸仰陛下之圣明，谓三代之隆，可复见于今日矣。",
      "description": "唐楷书代表作，由柳公权书写。"
    },
    {
      "id": "kai_009",
      "name": "雁塔圣教序",
      "aliases": [
        "雁塔圣教序"
      ],
      "script_type": "楷书",
      "author": "褚遂良",
      "dynasty": "唐",
      "year": "永徽四年",
      "type": "碑刻",
      "location": "陕西西安大慈恩寺",
      "total_chars": 1088,
      "content": "大唐三藏圣教序。太宗文皇帝制。弘福寺沙门怀仁集晋右军将军王羲之书。盖闻二仪有像，显覆载以含生；四时无形，潜寒暑以化物。是以窥天鉴地，庸愚皆识其端；明阴洞阳，贤哲罕穷其数。然而天地苞乎阴阳而易识者，以其有像也；阴阳处乎天地而难穷者，以其无形也。故知像显可征，虽愚不惑；形潜莫睹，在智犹迷。况乎佛道崇虚，乘幽控寂，弘济万品，典御十方。举威灵而无上，抑神力而无下。大之则弥于宇宙，细之则摄于毫厘。无灭无生，历千劫而不古；若隐若显，运百福而长今。妙道凝玄，遵之莫知其际；法流湛寂，挹之莫测其源。故知蠢蠢凡愚，区区庸鄙，投其旨趣，能无疑惑者哉！然则大教之兴，基乎西土，腾汉飞而皎梦，照东域而流慈。昔者，分形分迹之时，言未驰而成化；当常现常之世，民仰德而知遵。及乎晦影归真，迁仪越世。金容掩色，不镜三千之光；丽象开图，空端四八之相。于是微言广被，拯含类于三涂；遗训遐宣，导群生于十地。然而真教难仰，莫能一其旨归；曲学易遵，邪正于焉纷纠。所以空有之论，或习俗而是非；大小之乘，乍沿时而隆替。有玄奘法师者，法门之领袖也。幼怀贞敏，早悟三空之心；长契神情，先苞四忍之行。松风水月，未足比其清华；仙露明珠，讵能方其朗润。故以智通无累，神测未形，超六尘而迥出，只千古而无对。凝心内境，悲正法之陵迟；栖虑玄门，慨深文之讹谬。思欲分条析理，广彼前闻；截伪续真，开兹后学。是以翘心净土，往游西域。乘危远迈，杖策孤征。积雪晨飞，途间失地；惊砂夕起，空外迷天。万里山川，拨烟霞而进影；百重寒暑，蹑霜雨而前踪。诚重劳轻，求深愿达；周游西宇，十有七年。穷历道邦，询求正教。双林八水，味道餐风；鹿苑鹫峰，瞻奇仰异。承至言于先圣，受真教于上贤。探赜妙门，精穷奥业。一乘五律之道，驰骤于心田；八藏三箧之文，波涛于口海。爰自所历之国，总将三藏要文，凡六百五十七部，译布中夏，宣扬胜业。引慈云于西极，注法雨于东垂。圣教缺而复全，苍生罪而还福。湿火宅之干焰，共拔迷途；朗爱水之昏波，同臻彼岸。是知恶因业坠，善以缘升；升坠之端，惟人所托。譬夫桂生高岭，云露方得泫其华；莲出渌波，飞尘不能污其叶。非莲性自洁而桂质本贞，良由所附者高，则微物不能累；所凭者净，则浊类不能沾。夫以卉木无知，犹资善而成善；况乎人伦有识，不缘庆而求庆。方冀兹经传施，与日月而无穷；斯福遐敷，与乾坤而永大。朕才谢珪璋，言惭博达。至于内典，尤所未闲。昨制序文，深为鄙拙。唯恐秽翰墨于金简，标瓦砾于珠林。故知象教东渐，四百余载。虽初番传译，绵历烟霞；而前哲后贤，阐扬明白。今得玄奘法师，演畅真宗，阐扬妙理。可谓法云再荫，慧日重光。特望法师，降意勿辞，为朕述之。",
      "description": "唐楷书代表作，由褚遂良书写。"
    },
    {
      "id": "kai_010",
      "name": "孟庙碑",
      "aliases": [
        "孟庙碑"
      ],
      "script_type": "楷书",
      "author": "虞世南",
      "dynasty": "唐",
      "year": "贞观年间",
      "type": "碑刻",
      "location": "山东曲阜",
      "total_chars": 1158,
      "content": "孔子庙堂之碑。太子率更令渤海男欧阳询奉敕书。微臣属书东观，预闻前史。若乃知几其神，惟睿作圣，玄妙之境，希夷不测。然则三五迭兴，典坟斯著，神功圣迹，可得言焉。自肇立书契，初分爻象，委裘垂拱之风，革夏翦商之业。虽复质文殊致，进让罕同，靡不拜洛观河，膺符受命。名居域中之大，手握天下之图。象雷电以立威刑，法阳春而流惠泽。然后化渐八方，令行四海。未有偃息乡党，栖迟洙泗，不预帝王之录，远迹胥史之俦。而德侔覆载，明兼日月。道艺微而复显，礼乐弛而更张。穷理尽性，光前绝后，垂范百王，遗风于万代。猗欤！伟欤！若斯之盛者也！夫子膺五纬之精，踵千年之圣，固天纵以挺质，禀生德而降灵。载诞空桑，自标河海之状；才胜逢掖，克秀尧禹之姿。知微知章，可久可大。为而不宰，合天道于无言；感而遂通，显至仁于藏用。祖述先圣，宪章往哲。夫其道也，固以孕育陶钧，苞含造化，岂直席卷八代，并吞九邱而已哉！虽亚圣邻几之智，仰之而弥远；亡吴霸越之辨，谈之而不及。于时天历浸微，地维将绝，周室大坏，鲁道日衰，永叹时艰，实思濡足。遂乃降迹中都，俯临司寇。道超三代，止乎季孟之间；羞论五伯，终从大夫之后。固知栖遑弗已，志在于求仁；危逊从时，义存于拯溺。方且重反淳风，一匡末运。是以载贽以适诸侯，怀宝而游列国。玄览不极，应物如响，辨飞龟于石函，验集隼于金椟。触舟既晓，专车能对。识罔象之在川，明商羊之兴雨。知来藏往，一以贯之。但否泰有期，达人所以知命；卷舒唯道，明哲所以周身。牖里幽忧，方显姬文之德；夏台羁绁，弗累商王之武。陈蔡为幸，斯之谓欤。于是自卫反鲁，删书定乐，赞易道以测精微，修春秋以正褒贬。故能使紫微降光，丹书表瑞，济济焉！洋洋焉！充宇宙而洽幽明，动风云而润江海。斯皆纪乎竹素，悬诸日月。既而仁兽非时，鸣鸟弗至，哲人云逝，峻岳已隤。尚使泗水却流，波澜不息，鲁堂余响，丝竹犹传。非夫体道穷神，至灵知化，其孰能与于此乎？自时厥后，遗芳无绝。法被区中，道济天下。大唐运膺九五，基超七百。赫矣王猷，蒸哉景命，鸿名盛烈，无得称焉。皇帝钦明睿哲，参天两地。乃圣乃神，允文允武。经纶云始，时维龙战。爰整戎衣，用扶兴业。神谋不测，妙算无遗。宏济艰难，平壹区宇。纳苍生于仁寿，致君道于尧舜。武德九年十二月廿九日，有诏，立隋故绍圣侯孔嗣哲子德伦为褒圣侯。乃命经营，惟新旧址。万雉斯建，百堵皆兴。揆日占星，式规大壮。凤甍骞其特起，龙桷俨以临空。霞入绮寮，日晖丹槛。窅窅崇邃，悠悠虚白。模型写状，妙绝人功。象设已陈，肃焉如在。握文履度，复见仪形。凤跱龙蹲，犹临咫尺。唲尔微笑，若听武城之弦；怡然动色，似闻箫韶之响。襜襜盛服，既睹仲由；侃侃礼容，仍观卫赐。不疾而速，神其何远。至于仲春令序，时和景淑。皎絜璧池，圆流若镜，青葱槐市，总翠成帷。清涤元酒，致敬于兹日；合舞释菜，无绝于终古。",
      "description": "唐楷书代表作，由虞世南书写。"
    },
    {
      "id": "kai_011",
      "name": "董美人墓志",
      "aliases": [
        "董美人墓志"
      ],
      "script_type": "楷书",
      "author": "不可考",
      "dynasty": "隋",
      "year": "仁寿二年",
      "type": "碑刻",
      "location": "陕西西安",
      "total_chars": 522,
      "content": "美人姓董，汴州恤宜县人也。祖佛子，齐凉州刺史，敦仁博洽，标誉乡间。父后进，俶傥英雄，声驰河渷。美人体质闲华，天情婉嫕。恭以接上，顺以承亲。含华吐艳，竜章凤采；砌炳瑾瑜，庭芳兰蕙。既而来仪鲁殿，出事梁台，摇环珮于芳林，袨绮缋于春景。投壶工鹤飞之巧，弹棋穷巾角之妙。妖容倾国，冶笑千金；妆映池莲，镜澄窗月；态转迴眸之艳，香飘曳裾之风。飒洒委迤，吹花迴雪。以开皇十七年二月感疾，至七月十四日戊子终于仁寿宫山苐，春秋一十有九。农皇上药，竟无救于秦医；老君灵醮，徒有望于山士。怨此瑶华，忽焉彫悴；伤兹桂蕊，摧芳上年。以其年十月十二日，葬于龙首原。寂荒陇陇，幽夜茫茫。埋故爱于重泉，沉余娇于玄隧。惟灯设而神见，空想文成之术。弦管奏而泉濆，弥念姑舒之魂。触感兴悲，乃为铭曰：高唐独绝，阳台可怜。花耀芳囿，霞绮遥天。波惊洛浦，芝茂琼田。嗟乎頺日，还随湲川。比翼孤栖，同心只寝。风捲愁幙，冰寒泪枕。悠悠长暝，杳杳无春。落鬟摧榇，故黛凝尘。昔新悲故，今故悲新。余心留想，有念无人。去岁花台，临欢陪践。今兹秋夜，思人潜泫。遊神真宅，归骨玄房。依依泉路，萧萧白杨。孤坟山静，松疏月凉。瘗兹玉匣，传此余芳。惟开皇十七年岁次丁巳十月甲辰朔十二日乙卯，上柱国益州总管蜀王制。",
      "description": "隋楷书代表作，作者不可考。"
    },
    {
      "id": "kai_012",
      "name": "张猛龙碑",
      "aliases": [
        "张猛龙碑"
      ],
      "script_type": "楷书",
      "author": "不可考",
      "dynasty": "北魏",
      "year": "正光三年",
      "type": "碑刻",
      "location": "山东曲阜",
      "total_chars": 1061,
      "content": "魏鲁郡太守张府君清颂之碑。君讳猛龙，字神冏，南阳白水人也。其氏族分兴，源流所出，故已备详世录，不复具载。其先盖周宣时，张仲以孝友光缉姬室。晋大夫张老，春秋嘉其声绩。汉初赵景王张耳，浮沉秦汉之间，终跨列士之赏。才干世著，君其后也。魏明帝初中，西中郎将使持节平西将军凉州刺史瑍之十世孙。八世祖轨，晋永兴中，使持节安西将军护羌校尉凉州刺史西平公。七世祖素，轨之第三子，晋明帝太宁中，临羌都尉平西将军西海晋昌金城武威四郡太守，遂家武威。高祖钟信，凉州武宣王大沮渠时，建威将军武威太守。曾祖章，伪凉举秀才，本州治中从事史西海乐都二郡太守，还朝尚书祠部郎羽林监。祖兴宗，伪凉都营护军建节将军饶河黄河二郡太守。父生乐，归国。青衿之志，白首方坚。君体禀河灵，神资岳秀，桂质兰仪，德备仁孝。弱而好古，长而弥笃，入孝出弟，邦闾有名。虽黄金未应，无惭郭氏。友朋交游，超遥人表。年廿七，遭父忧，寝食过礼，泣血情深。既倾乾覆，唯恃坤慈。冬温夏清，晓夕承奉。家贫致养，不辞采运之勤。年卅九，丁母艰，勺饮不入，偷魂七朝。孤风独超，令誉日新，声驰天紫。以延昌中出身，除奉朝请，优游文省。朝廷以君阴望如此，德能宣畅，以熙平之年，除鲁郡太守。治民以礼，移风以乐。如伤之痛无怠于夙宵，若子之爱有怀于心目。是使学校克修，比屋清业，农桑劝课，以登入璄。观朝莫不礼让，化行无心，草石如变。恩及泉水，禽鱼自安。胜残不待赊年，有成期月而已。遂令讲习之音，再声于阙里；来苏之歌，复咏于洙中。京兆五守，无以克加；河南二尹，裁可若兹。至乃辞金退玉之贞耿，拨葵去织之信义，方之我君，今犹古也。诗云：恺悌君子，民之父母。实恐韶曦迁影，东风改吹，尽地民庶，逆深泫慕。是以刊石题咏，以旌盛美。其辞曰：氏焕天文，体承帝胤。神秀春方，灵源在震。积石千寻，长松万刃。轩冕周汉，冠盖魏晋。河灵岳秀，月起景飞。穷神开照，式诞英徽。高山仰止，从善如归。唯德是蹈，唯仁是依。栖迟下庭，素心若雪。鹤响难留，清音遐发。天心乃眷，观光玉阙。浣绂紫庭，承华烟月。妙简唯良，剖符儒乡。分金沂道，裂锦邹方。春明好养，温而厉霜。乃如之人，实国之良。礼以成政，化行草石。小大以情，恩深在民。濯此群冥，云褰天净。千里开明，学建礼修。风教反正，野畔让耕。饮河止满，度海迷津。勒石图铭，永扬芳尘。荡寇将军鲁郡丞北平白刃、义主参军事广平宋抚民、义主骧府骑兵参军骧威府长史征鲁府治城军主、义主本郡二政主簿、义主颜路、义主离狐令宋承憘、汾阳县义主南城令严孝武、义主贤文、阳平县义主州主簿王盆生。造颂四年，正光三年正月廿三日讫。",
      "description": "北魏楷书代表作，作者不可考。"
    },
    {
      "id": "kai_013",
      "name": "郑文公碑",
      "aliases": [
        "郑文公碑"
      ],
      "script_type": "楷书",
      "author": "郑道昭",
      "dynasty": "北魏",
      "year": "永平四年",
      "type": "碑刻",
      "location": "山东掖县",
      "total_chars": 580,
      "content": "魏故中书令秘书监使持节督兖州诸军事安东将军兖州刺史南阳郑文公之碑。永平四年，岁在辛卯，刊于天柱山之阳。公讳羲，字幼麟，荥阳开封人也。肇自炎帝，乃逮桓武。世祚绵远，英灵叠举。并宣功载籍，贻训子孙。高祖湛，燕太子洗马。曾祖略，魏平南咨议参军、济阴太守。祖豁，凉州刺史、安南将军、金城侯。父彦，中书侍郎、金城侯。公禀二仪之纯气，含章挺秀，志格遐龄，德光大雅。温仁博厚，洞启神机。孝敬表于闺门，仁义洽于乡党。少而好学，博览群书，尤善属文。弱冠举秀才，拜中书博士。迁中书侍郎、通直散骑常侍、冠军将军。转给事中、中书令、领秘书监。出为使持节督兖州诸军事、安东将军、兖州刺史。所在著绩，有遗爱之思。公以敏达之才，膺兹重任。宣风导礼，移俗兴治。政平讼理，民安业泰。性至孝，居父母忧，毁几灭性。服阕，起复本任。春秋六十有七，薨于位。天子震悼，群寮感哀。追赠使持节都督青齐济三州诸军事、镇东将军、青州刺史，谥曰文。公器宇弘深，风鉴明远。外柔内刚，博文约礼。处朝端而正色，居私室而怡然。当时宗工宿德，咸共推仰。故能出总蕃维，入参机密。声猷茂著，功业宣昭。刊石铭勋，永传不朽。其铭曰：绵绵洪胄，邈矣遐源。世载明德，代有哲人。於穆文公，含章挺秀。德配先民，道兼前构。人伦轨范，朝伦准的。出蕃入辅，宣功树绩。化行千里，道济群生。清风犹在，遗爱犹存。高山仰止，景行行止。刊石铭勋，永垂千祀。",
      "description": "北魏楷书代表作，由郑道昭书写。"
    },
    {
      "id": "kai_014",
      "name": "龙门二十品",
      "aliases": [
        "龙门二十品"
      ],
      "script_type": "楷书",
      "author": "多人",
      "dynasty": "北魏",
      "year": "5世纪",
      "type": "碑刻",
      "location": "河南洛阳",
      "total_chars": 173,
      "content": "龙门二十品是北魏时期龙门石窟造像题记中的二十件精品，包括《始平公造像记》《孙秋生造像记》《魏灵藏造像记》《杨大眼造像记》等。这些造像记多为发愿文，内容多为祈福消灾、供养佛像等。书法上，龙门二十品是魏碑体的代表，方笔斩截，结体紧密，气势雄强，对后世书法影响深远。其中《始平公造像记》为阳刻，其余为阴刻，风格各异，体现了北魏时期书法的多样性和创造性。",
      "description": "北魏楷书代表作，由多人书写。"
    },
    {
      "id": "kai_015",
      "name": "瘗鹤铭",
      "aliases": [
        "瘗鹤铭"
      ],
      "script_type": "楷书",
      "author": "不可考",
      "dynasty": "南朝梁",
      "year": "6世纪",
      "type": "摩崖",
      "location": "江苏镇江",
      "total_chars": 181,
      "content": "鹤寿不知其纪也，壬辰岁得于华亭，甲午岁化于朱方。天其未遂，吾翔寥廓耶？奚夺余仙鹤之遽也。乃裹以玄黄之巾，藏乎兹山之下，仙家无隐晦之志，我等故立石旌事篆铭不朽词曰：相此胎禽，浮丘之真，山阴降迹，华表留声。西竹法理，幸丹岁辰。真唯仿佛，事亦微冥。鸣语化解，仙鹤去莘，左取曹国，右割荆门，后荡洪流，前固重局，余欲无言，尔也何明？宜直示之，惟将进宁，爰集真侣，瘗尔作铭。",
      "description": "南朝梁楷书代表作，作者不可考。"
    },
    {
      "id": "kai_016",
      "name": "胆巴碑",
      "aliases": [
        "胆巴碑"
      ],
      "script_type": "楷书",
      "author": "赵孟頫",
      "dynasty": "元",
      "year": "延祐三年",
      "type": "碑刻",
      "location": "北京",
      "total_chars": 964,
      "content": "大元敕赐龙兴寺大觉普慈广照无上帝师之碑。集贤学士、资德大夫、臣赵孟頫奉敕撰并书篆。皇帝即位之元年，有诏金刚上师胆巴，赐谥大觉普慈广照无上帝师。敕臣孟頫为文并书，刻石大都寺。五年，真定路龙兴寺僧迭凡八奏，师本住其寺，乞刻石寺中。复敕臣孟頫为文并书。臣孟頫预议赐谥，大觉以言乎师之体，普慈以言乎师之用，广照以言慧光之所照临，无上以言为帝者师。即奏，有旨：于义甚当。谨按，师所生之地曰突甘斯旦麻，童子出家，事圣师绰理哲哇为弟子，受名胆巴。梵言胆巴，华言微妙。先受密戒法，继游西天竺国，遍参高僧，受经律论。繇是深入法海，博采道要，显密两融，空实兼照，独立三界，示众标的。至元七年，与帝师巴思八俱至中国。帝师者，乃圣师之昆弟子也。帝师告归西番，以教门之事属之于师，始于五台山建立道场，行秘密咒法，作诸佛事，祠祭摩诃迦剌。持戒甚严，昼夜不懈，屡彰神异，赫然流闻。自是德业隆盛，人天归敬。武宗皇帝、皇伯晋王及今皇帝、皇太后皆从受戒法，下至诸王将相贵人，委重宝为施身，执弟子礼，不可胜纪。龙兴寺建于隋时，寺有金铜大悲菩萨像。五代时契丹入镇州，纵火焚寺，像毁于火，周人取其铜以铸钱。宋太祖伐河东，像已毁，为之叹息。僧可传言，寺有复兴之谶。于是为降诏复造其像，高七十三尺，建大阁三重以覆之。旁翼之以两楼，壮丽奇伟，世未有也。师始来东土，寺讲主僧宣微大师普整、雄辩大师永安等，即礼请师为首住持。元贞元年正月，师忽谓众僧曰：将有圣人兴起山门。即为梵书奏徽仁裕圣皇太后，奉今皇帝为大功德主，主其寺。复谓众僧曰：汝等继今可日讲妙法莲华经，孰复相代，无有已时。用召集神灵，拥护圣躬，受无量福。至大元年，东宫既建，以旧邸田五十顷赐寺为常住业。大德七年，师在上都弥陁院入般涅槃，现五色宝光，获舍利无数。皇元一统天下，西蕃上师至中国不绝，操行谨严，具智慧神通，无如师者。臣孟頫为之颂曰：师从无始劫，学道不退转。十方诸如来，一一所受记。来世必成佛，住娑婆世界。演说无量义，身为帝王师。度脱一切众，黄金为宫殿。七宝妙庄严，种种诸珍异。供养无不备，建立大道场。邪魔及外道，破灭无踪迹。法力所护持，国土保安静。皇帝皇太后，寿命等天地。王宫诸眷属，下至于含生。归依法力故，皆证佛菩提。成就众善果，获无量福德。臣作如是言，传布于十方。下及未来世，赞叹不可尽。延祐三年七月立石。",
      "description": "元楷书代表作，由赵孟頫书写。"
    },
    {
      "id": "kai_017",
      "name": "洛神赋",
      "aliases": [
        "洛神赋"
      ],
      "script_type": "楷书",
      "author": "赵孟頫",
      "dynasty": "元",
      "year": "大德年间",
      "type": "墨迹",
      "location": "北京故宫",
      "total_chars": 1089,
      "content": "黄初三年，余朝京师，还济洛川。古人有言，斯水之神，名曰宓妃。感宋玉对楚王神女之事，遂作斯赋。其辞曰：余从京域，言归东藩。背伊阙，越轘辕，经通谷，陵景山。日既西倾，车殆马烦。尔乃税驾乎蘅皋，秣驷乎芝田，容与乎阳林，流眄乎洛川。于是精移神骇，忽焉思散。俯则未察，仰以殊观，睹一丽人，于岩之畔。乃援御者而告之曰：尔有觌于彼者乎？彼何人斯？若此之艳也！御者对曰：臣闻河洛之神，名曰宓妃。然则君王所见，无乃日乎？其状若何？臣愿闻之。余告之曰：其形也，翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。髣髴兮若轻云之蔽月，飘飖兮若流风之回雪。远而望之，皎若太阳升朝霞；迫而察之，灼若芙蕖出渌波。秾纤得衷，修短合度。肩若削成，腰如约素。延颈秀项，皓质呈露。芳泽无加，铅华弗御。云髻峨峨，修眉联娟。丹唇外朗，皓齿内鲜，明眸善睐，靥辅承权。瑰姿艳逸，仪静体闲。柔情绰态，媚于语言。奇服旷世，骨像应图。披罗衣之璀粲兮，珥瑶碧之华琚。戴金翠之首饰，缀明珠以耀躯。践远游之文履，曳雾绡之轻裾。微幽兰之芳蔼兮，步踟蹰于山隅。于是忽焉纵体，以遨以嬉。左倚采旄，右荫桂旗。壤皓腕于神浒兮，采湍濑之玄芝。余情悦其淑美兮，心振荡而不怡。无良媒以接欢兮，托微波而通辞。愿诚素之先达兮，解玉佩以要之。嗟佳人之信修兮，羌习礼而明诗。抗琼珶以和予兮，指潜渊而为期。执眷眷之款实兮，惧斯灵之我欺。感交甫之弃言兮，怅犹豫而狐疑。收和颜而静志兮，申礼防以自持。于是洛灵感焉，徙倚彷徨，神光离合，乍阴乍阳。竦轻躯以鹤立，若将飞而未翔。践椒涂之郁烈，步蘅薄而流芳。超长吟以永慕兮，声哀厉而弥长。尔乃众灵杂沓，命俦啸侣，或戏清流，或翔神渚，或采明珠，或拾翠羽。从南湘之二妃，携汉滨之游女。叹匏瓜之无匹兮，咏牵牛之独处。扬轻袿之猗靡兮，翳修袖以延伫。体迅飞凫，飘忽若神，凌波微步，罗袜生尘。动无常则，若危若安。进止难期，若往若还。转眄流精，光润玉颜。含辞未吐，气若幽兰。华容婀娜，令我忘餐。于是屏翳收风，川后静波。冯夷鸣鼓，女娲清歌。腾文鱼以警乘，鸣玉鸾以偕逝。六龙俨其齐首，载云车之容裔，鲸鲵踊而夹毂，水禽翔而为卫。于是越北沚，过南冈，纡素领，回清阳，动朱唇以徐言，陈交接之大纲。恨人神之道殊兮，怨盛年之莫当。抗罗袂以掩涕兮，泪流襟之浪浪。悼良会之永绝兮，哀一逝而异乡。无微情以效爱兮，献江南之明珰。虽潜处于太阴，长寄心于君王。忽不悟其所舍，怅神宵而蔽光。于是背下陵高，足往神留，遗情想像，顾望怀愁。冀灵体之复形，御轻舟而上溯。浮长川而忘返，思绵绵而增慕。夜耿耿而不寐，沾繁霜而至曙。命仆夫而就驾，吾将归乎东路。揽騑辔以抗策，怅盘桓而不能去。",
      "description": "元楷书代表作，由赵孟頫书写。"
    },
    {
      "id": "kai_019",
      "name": "小楷道德经",
      "aliases": [
        "小楷道德经"
      ],
      "script_type": "楷书",
      "author": "文徵明",
      "dynasty": "明",
      "year": "嘉靖年间",
      "type": "墨迹",
      "location": "上海博物馆",
      "total_chars": 656,
      "content": "道可道，非常道；名可名，非常名。无名，天地之始；有名，万物之母。故常无欲，以观其妙；常有欲，以观其徼。此两者，同出而异名，同谓之玄。玄之又玄，众妙之门。天下皆知美之为美，斯恶已；皆知善之为善，斯不善已。故有无相生，难易相成，长短相形，高下相倾，音声相和，前后相随。是以圣人处无为之事，行不言之教，万物作焉而不辞，生而不有，为而不恃，功成而弗居。夫唯弗居，是以不去。不尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。是以圣人之治，虚其心，实其腹，弱其志，强其骨。常使民无知无欲，使夫智者不敢为也。为无为，则无不治。道冲而用之或不盈，渊兮似万物之宗。挫其锐，解其纷，和其光，同其尘。湛兮似或存，吾不知谁之子，象帝之先。天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。天地之间，其犹橐龠乎？虚而不屈，动而愈出。多言数穷，不如守中。谷神不死，是谓玄牝。玄牝之门，是谓天地根。绵绵若存，用之不勤。天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人后其身而身先，外其身而身存。非以其无私邪？故能成其私。上善若水。水善利万物而不争，处众人之所恶，故几于道。居善地，心善渊，与善仁，言善信，正善治，事善能，动善时。夫唯不争，故无尤。持而盈之，不如其已。揣而锐之，不可长保。金玉满堂，莫之能守。富贵而骄，自遗其咎。功遂身退，天之道。载营魄抱一，能无离乎？专气致柔，能婴儿乎？涤除玄览，能无疵乎？爱民治国，能无知乎？天门开阖，能无雌乎？明白四达，能无为乎？生之畜之，生而不有，为而不恃，长而不宰，是谓玄德。",
      "description": "明楷书代表作，由文徵明书写。"
    },
    {
      "id": "kai_020",
      "name": "灵飞经",
      "aliases": [
        "灵飞经"
      ],
      "script_type": "楷书",
      "author": "钟绍京",
      "dynasty": "唐",
      "year": "开元年间",
      "type": "墨迹",
      "location": "美国大都会",
      "total_chars": 120,
      "content": "六甲灵飞，八景上清。玄宫玉晨，总御众灵。金书紫字，玉文丹章。龙衣虎带，玉佩金珰。身生羽翼，驾景乘光。遨游九玄，巡行十方。出入无间，役使万神。威制天魔，出入金门。朝贺太极，寝宴玉庭。速出阴房，太阳潜晖。三神并悦，五藏结华。举形轻举，上升帝晨。",
      "description": "唐楷书代表作，由钟绍京书写。"
    },
    {
      "id": "kai_021",
      "name": "前后赤壁赋",
      "aliases": [
        "前后赤壁赋",
        "前後赤壁賦",
        "赤壁赋",
        "后赤壁赋"
      ],
      "script_type": "楷书",
      "author": "文徵明",
      "dynasty": "明",
      "year": "嘉靖年间",
      "type": "墨迹",
      "location": "故宫博物院",
      "total_chars": 901,
      "assets": {
        "cover": "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-1.webp",
        "pages": [
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-1.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-2.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-3.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-4.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-5.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-6.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-7.webp",
          "/steles/3-kaishu/4-qianhouchibifu/qianhouchibifu-scroll.webp"
        ],
        "pagesThumb": [
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-1.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-2.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-3.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-4.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-5.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-6.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-7.webp",
          "/steles/3-kaishu/4-qianhouchibifu/thumbs/qianhouchibifu-scroll.webp"
        ],
        "guide": "/steles/3-kaishu/4-qianhouchibifu/guide.json",
        "charIndex": "/steles/3-kaishu/4-qianhouchibifu/chars_body_v13/index.json",
        "charText": "/steles/3-kaishu/4-qianhouchibifu/chars_body_v13/text.txt"
      },
      "content": "赤壁赋\n壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。\n\n于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。\n\n苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“月明星稀，乌鹊南飞，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”\n\n苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭，是造物者之无尽藏也，而吾与子之所共适。”\n\n客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。\n\n后赤壁赋\n是岁十月之望，步自雪堂，将归于临皋。二客从予过黄泥之坂。霜露既降，木叶尽脱，人影在地，仰见明月，顾而乐之，行歌相答。已而叹曰：“有客无酒，有酒无肴，月白风清，如此良夜何！”客曰：“今者薄暮，举网得鱼，巨口细鳞，状如松江之鲈。顾安所得酒乎？”归而谋诸妇。妇曰：“我有斗酒，藏之久矣，以待子不时之需。”\n\n于是携酒与鱼，复游于赤壁之下。江流有声，断岸千尺；山高月小，水落石出。曾日月之几何，而江山不可复识矣。予乃摄衣而上，履巉岩，披蒙茸，踞虎豹，登虬龙，攀栖鹘之危巢，俯冯夷之幽宫。盖二客不能从焉。划然长啸，草木震动，山鸣谷应，风起水涌。予亦悄然而悲，肃然而恐，凛乎其不可留也。反而登舟，放乎中流，听其所止而休焉。\n\n时夜将半，四顾寂寥。适有孤鹤，横江东来。翅如车轮，玄裳缟衣，戛然长鸣，掠予舟而西也。须臾客去，予亦就睡。梦一道士，羽衣蹁跹，过临皋之下，揖予而言曰：“赤壁之游乐乎？”问其姓名，俯而不答。“呜呼！噫嘻！我知之矣。畴昔之夜，飞鸣而过我者，非子也邪？”道士顾笑，予亦惊寤。开户视之，不见其处。",
      "description": "明·文徵明小楷书苏轼《前后赤壁赋》，两赋相距二十五年，清劲苍润，一笔不苟。"
    },
    {
      "id": "li_001",
      "name": "曹全碑",
      "aliases": [
        "曹全碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "185年",
      "type": "碑刻",
      "location": "陕西西安碑林",
      "total_chars": 849,
      "knowledge_id": "li_001",
      "assets": {
        "cover": "/steles/2-lishu/1-caoquanbei/caoquanbei-001.jpg",
        "pages": {
          "pattern": "/steles/2-lishu/1-caoquanbei/caoquanbei-{n}.jpg",
          "start": 1,
          "end": 47,
          "pad": 3
        },
        "charIndex": "/steles/2-lishu/1-caoquanbei/chars_yang/index.json",
        "charText": "/steles/2-lishu/1-caoquanbei/chars_yang/text.txt",
        "practice": [
          {
            "char": "曹",
            "hint": "秀逸不轻浮",
            "image": "/steles/2-lishu/1-caoquanbei/chars_yang/caoquanbei_yang_0043_U66F9.webp"
          },
          {
            "char": "全",
            "hint": "波磔舒展",
            "image": "/steles/2-lishu/1-caoquanbei/chars_yang/caoquanbei_yang_0003_U5168.webp"
          },
          {
            "char": "國",
            "hint": "横画主导",
            "image": "/steles/2-lishu/1-caoquanbei/chars_yang/caoquanbei_yang_0044_U570B.webp"
          }
        ],
        "pagesThumb": {
          "pattern": "/steles/2-lishu/1-caoquanbei/thumbs/caoquanbei-{n}.jpg",
          "start": 1,
          "end": 47,
          "pad": 3
        }
      },
      "content": "君讳全字景完敦煌效谷人也其先盖周之胄武王秉乾之机翦伐殷商既定尔勋福禄攸同封弟叔振铎于曹国因氏焉秦汉之际曹氏失官于斯而迁于雍州文郊止右扶风或在安定或在武都或居陇西或家敦煌枝分叶布所在为雄",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_002",
      "name": "礼器碑",
      "aliases": [
        "礼器碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "156年",
      "type": "碑刻",
      "location": "山东曲阜孔庙",
      "total_chars": 559,
      "content": "惟永寿二年，青龙在涒叹，霜月之灵，皇极之日。鲁相河南京韩君，追惟太古，华胥生皇雄，颜育孔宝，俱制元道，百王不改。孔子近圣，为汉定道。自天王以下，至于初学，莫不思叹卬师镜。颜氏圣舅，家居鲁亲里，并官圣妃，在安乐里。圣族之亲，礼所宜异。复颜氏并官氏邑中繇发，以尊孔心。念圣历世，礼乐陵迟，秦项作乱，不尊图书，倍道畔德，离败圣舆食粮，亡于沙丘。君于是造立礼器，乐之音符，钟磬瑟䜵，雷洗觞觚，爵鹿柤梪，笾柉禁壶，修饰宅庙，更作二舆，朝车威熹。宣抒玄污，以注水流。法旧不烦，备而不奢。上合紫台，稽之中和；下合圣制，事得礼仪。于是四方士仁，闻君风燿，敬咏其德，尊琦大人之意，逴之思，乃共立表石，纪传亿载。其文曰：皇戏统华胥，承天画卦。颜育空桑，孔制元孝，俱祖紫宫，大一所授。前闿九头，以升言教，后制百王，获麟来吐。制不空作，承天之语。乾元以来，三九之载，八皇三代，至孔乃备。圣人不世，期五百载。三阳吐图，二阴出谶，制作之义，以俟知奥。于穆韩君，独见天意，复圣二族，逴越绝思。修造礼乐，胡辇器用，存古旧宇，殷勤宅庙，朝车威熹，出诚造，不水解，工不争贾。深除玄污，水通四注。礼器升堂，天雨降澍。百姓訢和，举国蒙庆。神灵祐诚，竭敬之报。天与厥福，永享牟寿。上极华紫，旁伎皇代。刊石表铭，与乾运燿。长期荡荡，于盛复授。赫赫罔穷，声垂亿载。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_003",
      "name": "乙瑛碑",
      "aliases": [
        "乙瑛碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "153年",
      "type": "碑刻",
      "location": "山东曲阜孔庙",
      "total_chars": 499,
      "content": "司徒雄、司空戒稽首言：鲁前相瑛书言，诏书崇圣道，勉艺成，孔子作春秋，制孝经，演易，系辞，经纬天地，幽赞神明，故特立庙。褒成侯四时来祠，事已即去。庙有礼器，无常人掌领，请置百石卒史一人，典主守庙，春秋飨礼，财出王家钱，给犬酒直，须报。谨问太常祠曹掾冯牟、史郭玄辞对：故事辟雍礼未行，祠先圣师侍祠者，孔子子孙，太宰、太祝令各一人，皆备爵。太常丞监祠，河南尹给牛羊豕鸡各一，大司农给米祠。臣愚以为，如瑛言，孔子大圣，则象乾坤，为汉制作，先世所尊，祠用众牲，长侯备爵，今欲加宠子孙，敬恭明祀，传于罔极。可许，臣请许。臣雄、臣戒愚戆，顿首顿首，死罪死罪。臣稽首以闻。制曰：可。司徒公河南原武吴雄，字季高。司空公蜀郡成都赵戒，字志伯。元嘉三年三月廿七日壬寅奏雒阳宫。司隶校尉雒阳守河南尹名。下鲁相，承书从事，下当用者，选其年卌以上，经通一艺，杂试通利，能奉弘先圣之礼，为宗所归者，如诏书。书到言：永兴元年六月甲辰朔十八日辛酉，鲁相平，行长史事卞，守长薛，下守令，任（赵）兰，择其年卌以上，经通一艺，杂试能奉弘先圣之礼，为宗所归者，如诏书。书到言：永兴元年六月甲辰朔十八日辛酉，鲁相平行长史事卞守长薛下守令任兰。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_004",
      "name": "张迁碑",
      "aliases": [
        "张迁碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "186年",
      "type": "碑刻",
      "location": "山东泰安岱庙",
      "total_chars": 673,
      "content": "汉故谷城长荡阴令张君表颂。君讳迁，字公方，陈留己吾人也。其先出自周宣，有张仲以孝友为行，披览诗雅，焕知其祖。高帝龙兴，有张良，善运筹策，在帷幕之内，决胜负千里之外，析珪于留。文景之间，有张释之，建忠弼之谟，帝游上林，问禽狩所有，苑令不对，更问啬夫，啬夫事对，于是进啬夫为令，令退为啬夫。释之议为不可：苑令有公卿之才，啬夫喋喋小吏，非社稷之重。上从言，下之。亦有张骞，广通风俗，开定畿寓，南苞八蛮，西羁六戎，北震五狄，东勤九夷。荒远既殡，各贡所有。张是辅汉，世载其德。爰既且于君，盖其繵縺，缵戎鸿绪，牧守相系，不殒高问。孝弟于家，中謇于朝，治京氏易，聪丽权略，艺于从畋，少为郡吏，隐练职位，常在股肱，数为从事，声无细闻。征拜郎中，除谷城长，蚕月之务，不闭四门。腊正之祭，休囚归贺。八月算民，不烦于乡。随就虚落，存恤高年。路无拾遗，犁种宿野。黄巾初起，烧平城市，斯县独全。子贱孔蔑，其道区别，尚书五教，君崇其宽；诗云恺悌，君隆其恩；东里润色，君垂其仁。邵伯分陕，君懿于棠。晋阳佩玮，西门带弦，君之体素，能双其勋。流化八基，迁荡阴令。吏民颉颃，随送如云。周公东征，西人怨思。奚斯赞鲁，考父颂殷。前喆遗芳，有功不书，后无述焉。于是刊石立表，以示后昆。其辞曰：於赫张君，资质懿丰。德干仁义，纳于渊通。受性明后，岐嶷异常。乡党不齿，卧思接触。信义三年，礼乐是履。厉清白于皓首，建鸿勋于暮齿。拱极乎紫微，抗志乎高峙。邈邈令问，垂此丕则。赫赫政勋，显于尔职。临此二邦，命梏于□。陟明双配，永世是极。□不殒�殒□，□祀□□。刊石树表，永旐光识。垂之无穷，以志来兹。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_005",
      "name": "石门颂",
      "aliases": [
        "石门颂"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "约148年",
      "type": "摩崖",
      "location": "陕西汉中",
      "total_chars": 391,
      "content": "故司隶校尉楗为杨君颂。惟坤灵定位，川泽股分，各有所注，唐虞通夏，至于汉中，行轨不同，混齐群思，随阨纵横，用难南北，嘉平中，故司隶校尉杨君，厥字孟文，深执忠伉，数上奏请，有司议驳，君遂执争，百寮咸从，帝用是听，废子由斯，得其度经，功饬尔要，敞而晏平，清凉调和，烝烝艾宁，至建和二年，仲冬上旬，汉中太守王升，嘉慕高节，其德清美，邈在千年，世历显设，莫能识焉，其故吏尹贞、张祕、张任、张谋、杨和、吕国、毋俊、杜度、杨泳、周□、屠□□□□□□□□□□□□□□□□□□□□，嘉慕高节，追慕义烈，共立此碑，刊石纪功，以传后世。其辞曰：□□□□□□□，□□□□□□□，□□□□□□□，□□□□□□□，□□□□□□□。明明天子，俊德烈烈，稷契伊周，实惟良辅，宏济大化，守彼一隅，晏平西土，会于孟津，述职纳贡，莫敢不来，王命是将，无思不服。绍纵先迹，兴灭继绝，追修往古，复禹之迹，刊石纪述，垂示将来。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_006",
      "name": "华山碑",
      "aliases": [
        "华山碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "165年",
      "type": "碑刻",
      "location": "陕西华阴",
      "total_chars": 177,
      "content": "惟光和二年，有诏遣骑都尉边让、泰山太守仇审，以闰月廿三日甲子，祭告于华阴。其辞曰：於穆清庙，华岳之镇。其德配天，其明象日。岳镇四方，化行万国。云行雨施，品物流形。上下清和，万物咸亨。黎元蕃殖，阖境安宁。嘉瑞并臻，九谷登成。于是刊石立碑，昭示来世。其辞曰：巍巍太华，削成四方。惟岳降神，峻极于天。云兴肤寸，雨施八埏。化通万物，功被群生。刊石纪功，垂示无穷。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_007",
      "name": "史晨碑",
      "aliases": [
        "史晨碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "169年",
      "type": "碑刻",
      "location": "山东曲阜孔庙",
      "total_chars": 595,
      "content": "建宁二年，三月癸卯朔，七日己酉，鲁相臣晨、长史臣谦，顿首死罪，上尚书：臣晨顿首顿首，死罪死罪。臣蒙厚恩，受任符守，得在奎娄，周孔旧寓。不能阐弘德政，恢崇壹变，夙夜忧怖，累息屏营。臣晨顿首顿首，死罪死罪。臣以建宁元年到官，行秋飨，饮酒畔宫。毕，复礼孔子宅，拜谒神坐，仰瞻榱桷，俯视几筵，灵所冯依，肃肃犹存。而无公出酒脯之祠，臣即自以奉钱，修上案食醊具，以叙小节，不敢空谒。臣伏念：孔子乾坤所挺，西狩获麟，为汉制作，故《孝经援神挈》曰：玄丘制命帝卯行。又，《尚书考灵耀》曰：丘生仓际，触期稽度为赤制。故作《春秋》，以明文命。缀纪撰书，修定礼义。臣以为素王稽古，德亚皇代。虽有褒成世享之封，四时来祭，毕即归国。臣伏见临璧雍日，祠孔子以大牢，长吏备爵，所以尊先师重教化也。夫封土为社，立稷而祀，皆为百姓兴利除害，以祈丰穰。《月令》：祀百辟卿士有益于民。矧乃孔子，玄德焕炳，光于上下。而本国旧居，复礼之日，阙而不祀，诚朝廷圣恩所宜特加，臣寝息耿耿，情所思惟。臣辄依社稷，出王家谷，春秋行礼，以共烟祀，余赐先生执事。臣晨顿首顿首，死罪死罪。臣尽力思惟庶政，报称为效，增异辄上。臣晨诚惶诚恐，顿首顿首，死罪死罪。上尚书。时副言大傅、大尉、司徒、司空、大司农府治所部从事。昔在仲尼，汁光之精。大帝所挺，颜母毓灵。承敝遭衰，黑不代仓。流应聘，叹凤不臻。自卫反鲁，养徒三千。获麟趣作，端门见征，血书著纪，黄玉。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_008",
      "name": "衡方碑",
      "aliases": [
        "衡方碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "168年",
      "type": "碑刻",
      "location": "山东汶上",
      "total_chars": 283,
      "content": "汉故卫尉卿衡府君之碑。府君讳方，字兴祖，平原厌次人也。其先盖颛顼之苗裔，高辛之胤胄。本枝百世，应图受氏。列为侯伯，世载其勋。爰暨府君，体性纯和，秉彝常之操，履仁义之基。居家孝友，在朝忠贞。幼而好学，长而博文。通九经之义，穷百家之言。举孝廉，除郎中，迁太尉掾，出为平原太守。在任五年，政教明察，百姓安乐。征拜议郎，迁卫尉卿。以光和二年薨于位，春秋六十有三。天子哀悼，赐赠有加。于是故吏门生，相与立碑，刊石纪功，以垂后世。其辞曰：於穆府君，懿德孔彰。孝友于家，忠贞在朝。学贯九经，才兼百氏。出守平原，政平讼理。入拜卫尉，恪勤匪懈。溘焉薨殂，朝野伤怀。刊石立表，永世不忘。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_009",
      "name": "鲜于璜碑",
      "aliases": [
        "鲜于璜碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "165年",
      "type": "碑刻",
      "location": "天津艺术博物馆",
      "total_chars": 227,
      "content": "汉故雁门太守鲜于君碑。君讳璜，字伯谦，其先祖出于殷箕子之苗裔。汉兴，有鲜于中节，以功封侯，子孙因官遂居渔阳。曾祖文，祖父畅，父勋，皆有名位，世为著姓。君以孝廉举，除郎中，迁给事中，出为雁门太守。在郡九年，威震边陲，匈奴不敢犯塞。以永初元年薨于官，春秋六十有二。天子悼惜，赐赠有加。故吏从事秦鲜等，感君恩德，刊石立碑，以纪休烈。其辞曰：於穆君德，奕世载忠。内修孝友，外著勋功。出身事主，尽节竭诚。出守边郡，威震匈奴。边庭无警，黎庶安宁。功业不朽，刊石永铭。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_010",
      "name": "孔宙碑",
      "aliases": [
        "孔宙碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "164年",
      "type": "碑刻",
      "location": "山东曲阜孔庙",
      "total_chars": 219,
      "content": "汉故泰山都尉孔君之碑。君讳宙，字季将，孔子十九世之孙也。其先出自殷汤，防叔奔鲁，阙里定居，圣哲挺生，祖述宪章。君承圣绪，明德维馨。少习家学，长而博通。举孝廉，除郎中，迁都昌长。在任有惠政，百姓称颂。转元氏令，迁泰山都尉。以延熹六年正月乙未卒，春秋六十有一。于是故吏门人，乃共刊石，表铭洪烈。其辞曰：於穆我君，大圣之苗。明德惟馨，世载其劳。居家孝友，在朝忠贞。出宰二邑，化行如风。入赞泰山，秩宗允崇。命不延寿，士民所伤。刊石立表，永世不忘。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_011",
      "name": "衡方碑",
      "aliases": [
        "衡方碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "168年",
      "type": "碑刻",
      "location": "山东泰安",
      "total_chars": 283,
      "content": "汉故卫尉卿衡府君之碑。府君讳方，字兴祖，平原厌次人也。其先盖颛顼之苗裔，高辛之胤胄。本枝百世，应图受氏。列为侯伯，世载其勋。爰暨府君，体性纯和，秉彝常之操，履仁义之基。居家孝友，在朝忠贞。幼而好学，长而博文。通九经之义，穷百家之言。举孝廉，除郎中，迁太尉掾，出为平原太守。在任五年，政教明察，百姓安乐。征拜议郎，迁卫尉卿。以光和二年薨于位，春秋六十有三。天子哀悼，赐赠有加。于是故吏门生，相与立碑，刊石纪功，以垂后世。其辞曰：於穆府君，懿德孔彰。孝友于家，忠贞在朝。学贯九经，才兼百氏。出守平原，政平讼理。入拜卫尉，恪勤匪懈。溘焉薨殂，朝野伤怀。刊石立表，永世不忘。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_012",
      "name": "鲁峻碑",
      "aliases": [
        "鲁峻碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "173年",
      "type": "碑刻",
      "location": "山东汶上",
      "total_chars": 252,
      "content": "汉故司隶校尉鲁君碑。君讳峻，字仲严，山阳昌邑人也。其先出于周公，伯禽受封，世为鲁君。子孙以国为氏，遂居山阳。君少而明敏，长而好学。通五经之义，明六艺之旨。举孝廉，除郎中，迁侍御史，出为东郡太守。在任三年，政教清平，百姓安乐。征拜司隶校尉。在朝正色，不畏强御。以熹平二年薨于位，春秋五十有八。天子哀悼，赠赙有加。故吏从事李谦等，感念旧恩，刊石立碑，以纪明德。其辞曰：於穆鲁君，明德惟馨。少长好学，通五经义。出宰东郡，化行千里。入为司隶，正色朝廷。不畏强御，忠贞匪懈。不幸薨殂，士民伤悲。刊石纪功，垂示无穷。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_013",
      "name": "陡山城隍庙碑",
      "aliases": [
        "陡山城隍庙碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "约146年",
      "type": "摩崖",
      "location": "陕西汉中",
      "total_chars": 101,
      "content": "惟光和二年，有诏遣使者，以闰月廿三日甲子，祭告于城隍。其辞曰：於穆清庙，城隍之神。其德配天，其明象日。城隍之德，保境安民。云行雨施，品物流形。上下清和，万物咸亨。黎元蕃殖，阖境安宁。刊石立碑，昭示来世。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_014",
      "name": "封龙山颂",
      "aliases": [
        "封龙山颂"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "东汉",
      "year": "约156年",
      "type": "摩崖",
      "location": "河北元氏",
      "total_chars": 136,
      "content": "惟永寿三年，有诏遣使，以四月庚子朔廿八日丁卯，祭封龙山。其辞曰：於穆灵山，崇高极天。惟岳降神，生此英贤。云行雨施，品物流形。上下清和，万物咸亨。刊石立碑，昭示来世。其辞曰：巍巍封龙，峻极于天。惟岳降神，生此英贤。云兴肤寸，雨施八埏。化通万物，功被群生。刊石纪功，垂示无穷。",
      "description": "东汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_015",
      "name": "五凤刻石",
      "aliases": [
        "五凤刻石"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "西汉",
      "year": "前57年",
      "type": "摩崖",
      "location": "山东曲阜",
      "total_chars": 15,
      "content": "五凤二年，鲁卅四年六月四日成。",
      "description": "西汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_016",
      "name": "莱子侯刻石",
      "aliases": [
        "莱子侯刻石"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "西汉",
      "year": "前16年",
      "type": "摩崖",
      "location": "山东邹城",
      "total_chars": 28,
      "content": "始建国元年，莱子侯某，辟封于食，临老归乡里，为支人刻画。",
      "description": "西汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_017",
      "name": "群臣上酬刻石",
      "aliases": [
        "群臣上酬刻石"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "西汉",
      "year": "前4年",
      "type": "摩崖",
      "location": "山东东平",
      "total_chars": 27,
      "content": "群臣上酬，此石北。赵廿二年八月丙寅，群臣上酬，此石北。",
      "description": "西汉隶书代表作，作者不可考。"
    },
    {
      "id": "li_180",
      "name": "邓石如隶书",
      "aliases": [
        "邓石如隶书"
      ],
      "script_type": "隶书",
      "author": "邓石如",
      "dynasty": "清",
      "year": "乾嘉年间",
      "type": "墨迹",
      "location": "各博物馆藏",
      "total_chars": 248,
      "content": "邓石如，清代著名书法家、篆刻家，安徽怀宁人。原名琰，字石如，号顽伯，完白山人。其隶书得力于汉碑，尤得力于《衡方碑》《张迁碑》《曹全碑》等，自成一家。用笔浑厚雄强，结体茂密，气势磅礴，被誉为清代隶书第一人。其书法理论主张计白当黑，奇肆变化，对后世影响深远。代表作品有《崔子玉座右铭》《敖陶孙诗评》《文心雕龙》等。其隶书风格独特，横画肥而有骨，竖画劲而能拙，波磔分明而含蓄，结构宽博而紧密。邓石如以篆刻名世，书法篆刻并称，有完白山人之称。其艺术成就不仅在于技艺的精湛，更在于开创了皖派篆刻，影响深远。",
      "description": "清隶书代表作，由邓石如书写。"
    },
    {
      "id": "li_019",
      "name": "伊秉绶隶书",
      "aliases": [
        "伊秉绶隶书"
      ],
      "script_type": "隶书",
      "author": "伊秉绶",
      "dynasty": "清",
      "year": "乾嘉年间",
      "type": "墨迹",
      "location": "各博物馆藏",
      "total_chars": 213,
      "content": "伊秉绶，清代著名书法家，福建汀州人。字组似，号墨卿，默庵。其隶书得力于《衡方碑》《张迁碑》，又参以篆书笔意，自成一家。用笔圆浑厚重，结体宽博大气，章法疏朗有致，被誉为清代隶书大家。其书法风格独特，横平竖直，方正庄严，具有浓厚的金石气。代表作品有《默庵集锦》《留春草堂诗钞》等。伊秉绶曾任扬州知府，政绩卓著，为人清廉。其书法造诣精深，尤以隶书见长，与邓石如并称清代隶书双璧。其书论主张学古而不泥古，贵在得神，对后世书风影响深远。",
      "description": "清隶书代表作，由伊秉绶书写。"
    },
    {
      "id": "li_020",
      "name": "金农隶书",
      "aliases": [
        "金农隶书"
      ],
      "script_type": "隶书",
      "author": "金农",
      "dynasty": "清",
      "year": "乾嘉年间",
      "type": "墨迹",
      "location": "各博物馆藏",
      "total_chars": 232,
      "content": "金农，清代著名书画家，扬州八怪之首。字寿门，号冬心，曲江外史等。其隶书独辟蹊径，得力于《天发神谶碑》《国山碑》等，自成一家。用笔方劲古拙，结体奇崛，风格独特，人称漆书。其书法理论主张破旧立新，不随俗流。代表作品有《冬心先生集》《冬心题画》等。金农的漆书用笔如刷，横画粗重，竖画纤细，转折处方棱，具有强烈的视觉冲击力。其艺术风格怪异，与当时流行的帖学书风截然不同，体现了扬州八怪的创新精神。金农亦擅画竹、梅、鞍马、佛像、人物、山水，尤以墨梅见长，为清代画坛重要人物。",
      "description": "清隶书代表作，由金农书写。"
    },
    {
      "id": "zhuan_001",
      "name": "泰山刻石",
      "aliases": [
        "泰山刻石"
      ],
      "script_type": "篆书",
      "author": "李斯（传）",
      "dynasty": "秦",
      "year": "前219年",
      "type": "碑刻",
      "location": "山东泰安岱庙",
      "total_chars": 275,
      "content": "皇帝曰：金石刻尽始皇帝所为也。今袭号而金石刻辞不称始皇帝，其于久远也，如后嗣为之者，不称成功盛德。丞相臣斯、臣去疾、御史大夫臣德昧死言：臣请具刻诏书金石刻，因明白矣。臣昧死请。制曰：可。皇帝临立，作制明法，臣下修饬。廿有六年，初并天下，罔不宾服。亲巡远方黎民，登兹泰山，周览东极。从臣思迹，本原事业，祗诵功德。治道运行，诸产得宜，皆有法式。大义休明，垂于后世，顺承勿革。皇帝躬圣，既平天下，不懈于治。夙兴夜寐，建设长利，专隆教诲。训经宣达，远近毕理，咸承圣志。贵贱分明，男女礼顺，慎遵职事。昭隔内外，靡不清净，施于后嗣。化及无穷，遵奉遗诏，永承重戒。",
      "description": "秦篆书代表作，由李斯（传）书写。"
    },
    {
      "id": "zhuan_002",
      "name": "琅琊刻石",
      "aliases": [
        "琅琊刻石"
      ],
      "script_type": "篆书",
      "author": "李斯（传）",
      "dynasty": "秦",
      "year": "前218年",
      "type": "碑刻",
      "location": "山东诸城",
      "total_chars": 360,
      "content": "维廿八年，皇帝作始。端平法度，万物之纪。以明人事，合同父子。圣智仁义，显白道理。东抚东土，以省卒士。事已大毕，乃临于海。皇帝之功，勤劳本事。上农除末，黔首是富。普天之下，抟心揖志。器械一量，同书文字。日月所照，舟舆所载。皆终其命，莫不得意。应时动事，是维皇帝。匡饬异俗，陵水经地。忧恤黔首，朝夕不懈。除疑定法，咸知所辟。方伯分职，诸治经易。举错必当，莫不如画。皇帝之明，临察四方。尊卑贵贱，不逾次行。奸邪不容，皆务贞良。细大尽力，莫敢怠荒。远迩辟隐，专务肃庄。端直敦忠，事业有常。皇帝之德，存定四极。诛乱除害，兴利致福。节事以时，诸产繁殖。黔首安宁，不用兵革。六亲相保，终无寇贼。驩欣奉教，尽知法式。六合之内，皇帝之土。西涉流沙，南尽北户。东有东海，北过大夏。人迹所至，无不臣者。功盖五帝，泽及牛马。莫不受德，各安其宇。",
      "description": "秦篆书代表作，由李斯（传）书写。"
    },
    {
      "id": "zhuan_003",
      "name": "峄山刻石",
      "aliases": [
        "峄山刻石"
      ],
      "script_type": "篆书",
      "author": "李斯（传）",
      "dynasty": "秦",
      "year": "前219年",
      "type": "碑刻",
      "location": "陕西西安碑林/山东邹城",
      "total_chars": 222,
      "knowledge_id": "zhuan_001",
      "assets": {
        "cover": "/steles/1-zhuanshu/1-yishankeshi/yishan.jpg",
        "pages": [
          "/steles/1-zhuanshu/1-yishankeshi/yishan.jpg",
          "/steles/1-zhuanshu/1-yishankeshi/yishan2.jpg"
        ],
        "practice": [
          {
            "char": "皇",
            "hint": "中锋圆转",
            "image": "/steles/extracted_by_grid/char_0001.png"
          },
          {
            "char": "帝",
            "hint": "匀净如铁线",
            "image": "/steles/extracted_by_grid/char_0002.png"
          },
          {
            "char": "立",
            "hint": "结体对称",
            "image": "/steles/extracted_by_grid/char_0003.png"
          }
        ]
      },
      "content": "皇帝曰金石刻尽始皇帝所为也今袭号而金石刻辞不称始皇帝其于久远也如后嗣为之者不称成功盛德丞相臣斯臣去疾御史大夫臣德昧死言臣请具刻诏书金石刻因明白矣臣昧死请制曰可皇帝立国维初在昔嗣世称王讨伐乱逆威动四极武义直方戎臣奉诏经时不久灭六暴强廿有六年上荐高号孝道显明既献泰成乃降专惠亲巡远方登于绎山群臣从者咸思攸长追念乱世分土建邦以开争理功战日作流血于野自泰古始世无万数陀及五帝莫能禁止乃今皇帝一家天下兵不复起灾害灭除黔首康定利泽长久群臣诵略刻此乐石以著经纪皇帝曰金石刻尽始皇帝所为也今袭号而金石刻辞不称始皇帝其于久远也如后嗣为之者不称成功盛德丞相臣斯臣去疾御史大夫臣德昧死言臣请具刻诏书金石刻因明白矣臣昧死请制曰可",
      "description": "秦篆书代表作，由李斯（传）书写。"
    },
    {
      "id": "zhuan_004",
      "name": "会稽刻石",
      "aliases": [
        "会稽刻石"
      ],
      "script_type": "篆书",
      "author": "李斯（传）",
      "dynasty": "秦",
      "year": "前210年",
      "type": "碑刻",
      "location": "浙江绍兴",
      "total_chars": 360,
      "content": "皇帝休烈，平壹宇内，德惠修长。卅有七年，亲巡天下，周览远方。遂登会稽，宣省习俗，黔首斋庄。群臣诵功，本原事迹，追首高明。秦圣临国，始定刑名，显陈旧章。初平法式，审别职任，以立恒常。六王专倍，贪戾慠猛，率众自强。暴虐恣行，负力而骄，数动甲兵。阴通间使，以事合从，行为辟方。内饰诈谋，外来侵边，遂起祸殃。义威诛之，殄熄暴悖，乱贼灭亡。圣德广密，六合之中，被泽无疆。皇帝并宇，兼听万事，远近毕清。运理群物，考验事实，各载其名。贵贱并通，善否陈前，靡有隐情。饰省宣义，有子而嫁，倍死不贞。防隔内外，禁止淫泆，男女絜诚。夫为寄豭，杀之无罪，男秉义程。妻为逃嫁，子不得母，咸化廉清。大治濯俗，天下承风，蒙被休经。皆遵度轨，和安敦勉，莫不顺令。黔首修絜，人乐同则，嘉保太平。后敬奉法，常治无极，舆舟不倾。从臣诵烈，请刻此石，光垂休铭。",
      "description": "秦篆书代表作，由李斯（传）书写。"
    },
    {
      "id": "zhuan_005",
      "name": "毛公鼎铭文",
      "aliases": [
        "毛公鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前11世纪",
      "type": "青铜器",
      "location": "台湾故宫",
      "total_chars": 523,
      "content": "王若曰：父歆，丕显文武，皇天引厌劂德，配我有周，膺受大命，率怀不廷方，亡不觐于文武耿光。唯天将集厥命，亦唯先正略又劂辟，属谨大命，肆皇天亡，临保我有周，丕巩先王配命，旻天疾威，嗣余小子弗役邦，将曷吉？迹迹四方，大从丕静。呜呼！惧作小子溷湛于艰，永巩先王。王曰：父歆，余唯肇经先王命，命汝辥我邦，我家内外，憃于小大政，屏朕位，虩许上下若否。宁四方，死毋动，一竞，敬兹德，赐汝玄衮衣、赤舄、銮旗、彤弓、彤矢、銮旂，用征以乃事。王曰：父歆，昔余既命汝作冢司，今余唯或申命汝，赐汝秬鬯一卣、裸圭瓒宝、朱市、悤黄、玉环、玉瑹金车、绎较、朱嚣弘斩、虎冟熏裹、右厄、画鞴、画輴、金甬、错衡、金童、金豙、涑燢、金簟笰、鱼箙、马四匹、攸勒、金口、金膺、朱旂二铃，汝毋敢弗帅用先王作明井，俗汝毋敢于酗在乃服，隅夙夕敬念王畏不赐。女母曰苟然，毋起狱以谋，毋有不义，讯于先王，汝惟敬享哉！父歆，已曰及兹卿事寮，大史寮，于父即尹，命汝摄司公族，雩三有司，小子，师氏，虎臣，雩朕亵事，以乃族干吾王身，取专卅寽，赐汝秬鬯一卣、圭瓒、副毳尝、朱市、悤黄、玉环、玉瑹金车、马四匹、攸勒、金口、金膺、朱旂二铃，汝毋弗善效姜氏命。毋敢或乱剂，慎辞，用作宝尊彝，唯用妥福，前文人永宝用。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_006",
      "name": "散氏盘铭文",
      "aliases": [
        "散氏盘铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "约前9世纪",
      "type": "青铜器",
      "location": "台湾故宫",
      "total_chars": 437,
      "content": "用夨扑散邑，乃即散用田。履：自瀗涉以南，至于大沽，一封，以陟，二封，至于边柳，复涉瀗，陟，徂，以西，封于酜城，楛木，封于刍，封于刍，内陟刍，登于厂，封，树，封，封于单道，封于原道，封于周道。以东，封于，东强，右还，封于厜道。以南，封于，道，以西，至于，莫。履井邑田：自，木道，左至于井邑，封道，以东，一封，还，以西，一封，陟刚，三封，降，以南，封于同道。陟州刚，登，降，棫，二封。夨人有司履田：鲜、且、、武父、西宫襄、豆人虞丂、录贞、师氏右眚、小门人、原人虞艿、淮司工虎、孝、、丰父、人有司丂，凡十又五夫。正履夨舍散田：司土逆寅、司马单、人司工君、宰德父，散人小子履田：戎、（微）父、教父、襄之有司橐、州、修从，凡散有司十夫。唯王九月，辰在乙卯，夨卑鲜、且、、旅誓，曰：我既付散氏田器，有爽，实余有散氏心贼，则爰千罚千，传弃之。鲜、且、、旅则誓。乃卑西宫襄、武父誓，曰：我既付散氏隰田、亩田，余有爽变，爰千罚千。西宫襄、武父则誓。厥受图，夨王于豆新宫东廷。厥左执，史正中农。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_007",
      "name": "虢季子白盘铭文",
      "aliases": [
        "虢季子白盘铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前9世纪",
      "type": "青铜器",
      "location": "中国国家博物馆",
      "total_chars": 137,
      "content": "惟十又二年，正月初吉丁亥，虢季子白作宝盘。丕显子白，壮武于戎工，经维四方。搏伐猃狁，于洛之阳，折首五百，执讯五十，是以先行。桓桓子白，献馘于王，王孔嘉子白义。王各周庙宣，爰飨。王曰：伯父，孔显有光。王赐乘马，是用左王；赐用弓，彤矢其央；赐用戉，用政蛮方。子子孙孙，万年无疆。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_008",
      "name": "墙盘铭文",
      "aliases": [
        "墙盘铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前10世纪",
      "type": "青铜器",
      "location": "陕西扶风",
      "total_chars": 182,
      "content": "曰古文王，初盩和于政，上帝降懿德大屏，匍有上下，受万邦。隹匍昭王，广能楚荆，隹狩南行。隹匍穆王，井帅宇诲，宁天子，天子，文武长烈，天子眉无匃，繄祁上下，亟熙慕，吴，亡昊。上帝司夒，尣保受天子，绾令，厚福，丰年，方，蛮亡不𤼷见。青幽高且，才微灵处。武王既殷，史刺且乃来见武王，武王则令周公舍，于周卑处。乙且，匹厥辟，远猷，腹心子，纳彝义，其敢用天子，鲁令，作宝尊彝。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_009",
      "name": "大盂鼎铭文",
      "aliases": [
        "大盂鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前11世纪",
      "type": "青铜器",
      "location": "中国国家博物馆",
      "total_chars": 389,
      "content": "唯九月，王在宗周，命盂。王若曰：盂，丕显文王受天有大命，在武王嗣文王作邦，辟厥匿，匍有四方，畯正厥民。在于御事，酒无敢酖，有祡蒸祀无敢扰，故天翼临子，法保先王，匍有四方。我闻殷坠命，唯殷边侯甸，与殷正百辟，率肄于酒，故丧师。已女妹辰有大服，余唯即朕小学，女勿克余乃辟一人。今我唯即型禀于文王正德，若文王命二三正。今余唯命女盂，绍荣，敬雍德经，敏朝夕入谏，享奔走，畏天威。王曰：而，令女盂，型乃嗣且南公。王曰：盂，乃绍夹死司戎，敏谏罚讼，夙夕绍我一人，四方。肆于政，故天翼临保我，丕显先王，匍有四方。殷正百辟，率肄于酒，古丧自。已汝妹辰有大服，余唯即朕小学。易女鬯一卣、冂、衣、市、舄、车马。易乃且南公旂，用狩。易女邦司四伯，人鬲自驭至于庶人六百又五十又九夫。易夷司王臣十又三伯，人鬲千又五十夫。徼，自厥土。王曰：盂，若敬乃正，勿废朕令。盂用对王休，用作祖南公宝鼎。唯王廿又三祀。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_010",
      "name": "颂鼎铭文",
      "aliases": [
        "颂鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前9世纪",
      "type": "青铜器",
      "location": "各博物馆藏",
      "total_chars": 185,
      "content": "唯三年五月既死霸甲戌，王在周康邵宫。旦，王格大室，即立。宰引右颂入门，立中廷。尹氏受王命书，王呼史虢生册命颂。王若曰：颂，命汝官司成周贮廿家，监司新造，贮用宫御。易女玄衣黹纯、赤芾、朱黄、銮旂、攸勒，用事。颂拜稽首，受命册，佩以出，反入堇章。颂敢对扬天子丕显鲁休，用作皇考龚叔、皇母龚姒宝尊鼎。用追孝，祈介康，屯右、通禄永令。颂其万年眉寿，畯臣天子，霝终，子子孙孙宝用。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_011",
      "name": "师望鼎铭文",
      "aliases": [
        "师望鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前10世纪",
      "type": "青铜器",
      "location": "上海博物馆",
      "total_chars": 175,
      "content": "惟十又三年六月初吉戊戌，王在周康宫新宫。旦，王格大室，即立。宰倗右师望入门，立中廷。尹氏受王命书，王呼史年册命师望。王若曰：师望，在昔先王，既令汝作司土，官醉，唯辟。今余唯申先王命，令汝官司邑人，师氏，司治王妾，并附庸田土，赏罚，用既，勿废朕命。赐女玄衮衣、赤舄、銮旗、攸勒。师望拜稽首，敢对扬天子丕显鲁休，用作朕皇考定伯尊鼎，其万年子子孙孙永宝用。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_012",
      "name": "毛公歆鼎铭文",
      "aliases": [
        "毛公歆鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前11世纪",
      "type": "青铜器",
      "location": "台北故宫",
      "total_chars": 245,
      "content": "王若曰：歆，丕显文武，皇天引厌劂德，配我有周，膺受大命，率怀不廷方，亡不觐于文武耿光。唯天将集厥命，亦唯先正略又劂辟，属谨大命，肆皇天亡，临保我有周，丕巩先王配命，旻天疾威，嗣余小子弗役邦，将曷吉？迹迹四方，大从丕静。呜呼！惧作小子溷湛于艰，永巩先王。王曰：歆，余唯肇经先王命，命汝辥我邦，我家内外，憃于小大政，屏朕位，虩许上下若否。宁四方，死毋动，一竞，敬兹德，赐汝玄衮衣、赤舄、銮旗、彤弓、彤矢、銮旂，用征以乃事。歆拜稽首，敢对扬天子丕显鲁休，用作朕皇考武公尊鼎，其万年子子孙孙永宝用。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_013",
      "name": "戍嗣子鼎铭文",
      "aliases": [
        "戍嗣子鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "商代",
      "year": "前13世纪",
      "type": "青铜器",
      "location": "河南安阳",
      "total_chars": 37,
      "content": "丙午，王赏戍嗣子贝廿朋，在阑□。用作父癸宝鼎。唯王□阑□，用大□，□子□。",
      "description": "商代篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_014",
      "name": "利簋铭文",
      "aliases": [
        "利簋铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "西周",
      "year": "前11世纪",
      "type": "青铜器",
      "location": "陕西临潼",
      "total_chars": 40,
      "content": "珷征商，唯甲子朝，岁鼎克昏，夙有商。辛未，王在阑师，赐有事利金，用作檀公宝尊彝。",
      "description": "西周篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_015",
      "name": "殷墟甲骨文",
      "aliases": [
        "殷墟甲骨文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "商代",
      "year": "前13-前11世纪",
      "type": "甲骨",
      "location": "河南安阳",
      "total_chars": 178,
      "content": "殷墟甲骨文是商代晚期刻在龟甲兽骨上的文字，内容多为占卜记录。其文辞包括卜辞和记事刻辞两类。卜辞内容包括祭祀、战争、田猎、疾病、农业、天气等。记事刻辞则记录甲骨来源、整治者、保管者等。甲骨文是中国最早的成熟文字系统，对研究商代历史和汉字发展具有重要价值。代表作品有《大版》《小屯南地甲骨》《花园庄东地甲骨》等。甲骨文字形象形性强，结构多变，具有古朴自然之美。",
      "description": "商代篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_016",
      "name": "司母戊鼎铭文",
      "aliases": [
        "司母戊鼎铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "商代",
      "year": "前13世纪",
      "type": "青铜器",
      "location": "中国国家博物馆",
      "total_chars": 4,
      "content": "司母戊。",
      "description": "商代篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_017",
      "name": "四祀邲其卣铭文",
      "aliases": [
        "四祀邲其卣铭文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "商代",
      "year": "前11世纪",
      "type": "青铜器",
      "location": "故宫博物院",
      "total_chars": 23,
      "content": "丙午，王赏邲其贝廿朋，在四祀。用作父丁宝尊彝。",
      "description": "商代篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_018",
      "name": "石鼓文",
      "aliases": [
        "石鼓文"
      ],
      "script_type": "篆书",
      "author": "不可考",
      "dynasty": "春秋/战国",
      "year": "前8-前3世纪",
      "type": "石刻",
      "location": "故宫博物院",
      "total_chars": 427,
      "content": "吾车既工，吾马既同。吾车既好，吾马既阜。君子员猎，员猎员游。麀鹿速速，君子之求。角弓其觩，翩其来思。吾驱其特，其来趩趩。吾即于原，即于原止。田车孔安，鋚勒既简。左驂旛旛，右驂騝騝。吾以郪于原，吾止陇宫。车其写，秀弓寺射。麋豕孔庶，麀鹿雉兔。其原有绅，其奔大出。各亚皋若，执而勿射。多庶峱峱，君子迺乐。原水既清，漫水既平。既止嘉止，霝雨时降。彼泽既滂，乃得既明。驾言西归，马序其齐。君子乐胥，于胥乐兮。汧殹沔沔，烝彼淖渊。鰋鲤处之，君子渔之。澫又小鱼，其游散散。帛鱼皪皪，其篮氐鲜。黄白其鳊，有鲂有鲐。其孔庶，脔之毚毚。君之车弓，弓兹以寺。汧殹毋害，涉川鼓舟。汧殹自廓，涉川鼓舟。徒驭汤汤，维舟以行。或阴或阳，极深以户。其鱼维何，维鱮维鲤。何以贯之，唯杨及柳。銮车既饬，弓矢既调。射夫旅进，各献其功。允文允武，昭于厥庸。麀鹿楚楚，君子所射。其般肩肩，其来趩趩。君子迺乐，乐胥于胥。马其齐，齐其马。君子之马，既齐且多。其鱼维何，维鲂维鲤。何以享之，维杨及柳。",
      "description": "春秋/战国篆书代表作，作者不可考。"
    },
    {
      "id": "zhuan_019",
      "name": "邓石如篆书",
      "aliases": [
        "邓石如篆书"
      ],
      "script_type": "篆书",
      "author": "邓石如",
      "dynasty": "清",
      "year": "乾嘉年间",
      "type": "墨迹",
      "location": "各博物馆藏",
      "total_chars": 211,
      "content": "邓石如，清代著名书法家、篆刻家，安徽怀宁人。其篆书得力于《石鼓文》《泰山刻石》《峄山刻石》等，自成一家。用笔浑厚圆劲，结体茂密，气势磅礴，被誉为清代篆书第一人。其篆书风格独特，以隶书笔法作篆，使篆书笔法更加丰富。代表作品有《白氏草堂记》《谦卦》等。邓石如篆书成就极高，打破了自唐以来篆书的僵化局面，开创了篆书的新风格。其篆书特点是方圆并用，刚柔相济，结构严谨而不失灵动。邓石如篆刻亦以篆书为基础，开创了皖派篆刻，影响深远。",
      "description": "清篆书代表作，由邓石如书写。"
    },
    {
      "id": "zhuan_020",
      "name": "吴昌硕篆书",
      "aliases": [
        "吴昌硕篆书"
      ],
      "script_type": "篆书",
      "author": "吴昌硕",
      "dynasty": "清末民初",
      "year": "20世纪初",
      "type": "墨迹",
      "location": "各博物馆藏",
      "total_chars": 234,
      "content": "吴昌硕，清末民初著名书画家、篆刻家，浙江安吉人。初名俊，后改俊卿，字昌硕，号缶庐，苦铁等。其篆书得力于《石鼓文》，潜心研习数十年，自成一家。用笔雄浑苍劲，结体茂密，气势磅礴，被誉为石鼓篆书第一家。其书法风格独特，以金石气见长，笔画粗犷有力，结构紧凑。代表作品有《缶庐集》《吴昌硕作品集》等。吴昌硕的篆书融合篆刻刀法，用笔如刀，线条富有质感。其艺术成就不仅在于书法，更在于将诗书画印融为一体，开创了海派艺术的新局面。吴昌硕曾任西泠印社首任社长，对近现代书画篆刻影响深远。",
      "description": "清末民初篆书代表作，由吴昌硕书写。"
    },
    {
      "id": "xing_001",
      "name": "兰亭序",
      "aliases": [
        "兰亭序",
        "蘭亭序"
      ],
      "script_type": "行书",
      "author": "王羲之",
      "dynasty": "东晋",
      "year": "",
      "type": "墨迹",
      "location": "故宮博物院（神龍本）",
      "total_chars": 324,
      "assets": {
        "cover": "/steles/4-xingshu/1-lantingjixu/lantingjixu-1.jpg",
        "pages": [
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-1.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-2.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-3.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-4.jpg"
        ],
        "pagesThumb": [
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-1.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-2.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-3.jpg",
          "/steles/4-xingshu/1-lantingjixu/lantingjixu-4.jpg"
        ],
        "charIndex": "/steles/4-xingshu/1-lantingjixu/lanting-HCCG-CycleGAN/index.json",
        "charText": "/steles/4-xingshu/1-lantingjixu/lanting-HCCG-CycleGAN/text.txt",
        "practice": [
          {
            "char": "永",
            "hint": "起笔含蓄，收笔沉着",
            "image": "/steles/4-xingshu/1-lantingjixu/lanting-HCCG-CycleGAN/0001.jpg"
          },
          {
            "char": "和",
            "hint": "提按分明，连带自然",
            "image": "/steles/4-xingshu/1-lantingjixu/lanting-HCCG-CycleGAN/0002.jpg"
          },
          {
            "char": "九",
            "hint": "转折见筋骨，行气要稳",
            "image": "/steles/4-xingshu/1-lantingjixu/lanting-HCCG-CycleGAN/0003.jpg"
          }
        ]
      },
      "content": "永和九年嵗在癸丑暮春之初會于會稽山隂之蘭亭脩稧事也羣賢畢至少長咸集此地有崇山峻領茂林脩竹又有清流激湍暎帶左右引以為流觴曲水列坐其次雖無絲竹管弦之盛一觴一詠亦足以暢敘幽情是日也天朗氣清恵風和暢仰觀宇宙之大俯察品類之盛所以遊目騁懐足以極視聽之娛信可樂也夫人之相與俯仰一世或取諸懐抱悟言一室之内或因寄所託放浪形骸之外雖趣舎萬殊静躁不同當其欣扵所遇暫得扵己怏然自足不知老之将至及其所之既惓情随事遷感慨係之矣向之所欣俛仰之閒以為陳迹猶不能不以之興懐况脩短随化終期扵盡古人云死生亦大矣豈不痛哉每攬昔人興感之由若合一契未嘗不臨文嗟悼不能喻之扵懐固知一死生為虛誕齊彭殤為妄作後之視今亦由今之視昔悲夫故列敘時人錄其所述雖世殊事異所以興懐其致一也後之攬者亦将有感扵斯文",
      "description": "行书第一，飘若浮云、矫若惊龙。"
    },
    {
      "id": "xing_002",
      "name": "祭侄文稿",
      "aliases": [
        "祭侄文稿",
        "祭姪文稿"
      ],
      "script_type": "行书",
      "author": "颜真卿",
      "dynasty": "唐",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "壮烈之美，情真笔亦真。"
    },
    {
      "id": "xing_003",
      "name": "黄州寒食帖",
      "aliases": [
        "黄州寒食帖",
        "黃州寒食帖"
      ],
      "script_type": "行书",
      "author": "苏轼",
      "dynasty": "北宋",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "文人之心，笔里有风雨。"
    },
    {
      "id": "xing_004",
      "name": "集字圣教序",
      "aliases": [
        "集字圣教序",
        "集字聖教序"
      ],
      "script_type": "行书",
      "author": "怀仁（集王羲之书）",
      "dynasty": "唐",
      "year": "",
      "type": "碑刻",
      "location": "西安碑林博物館",
      "total_chars": 0,
      "content": "",
      "description": "典雅极致，唐代集字之极则。"
    },
    {
      "id": "xing_005",
      "name": "蜀素帖",
      "aliases": [
        "蜀素帖"
      ],
      "script_type": "行书",
      "author": "米芾",
      "dynasty": "北宋",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "风樯阵马，米芾行书巅峰。"
    },
    {
      "id": "xing_006",
      "name": "松风阁诗",
      "aliases": [
        "松风阁诗",
        "松風閣詩"
      ],
      "script_type": "行书",
      "author": "黄庭坚",
      "dynasty": "北宋",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "老干发青，骨力苍劲。"
    },
    {
      "id": "xing_007",
      "name": "韭花帖",
      "aliases": [
        "韭花帖",
        "韭花帖"
      ],
      "script_type": "行书",
      "author": "杨凝式",
      "dynasty": "五代",
      "year": "",
      "type": "墨迹",
      "location": "無錫博物館（拓本）/ 故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "清逸淡远，尺牍之雅。"
    },
    {
      "id": "xing_008",
      "name": "伯远帖",
      "aliases": [
        "伯远帖",
        "伯遠帖"
      ],
      "script_type": "行书",
      "author": "王珣",
      "dynasty": "东晋",
      "year": "",
      "type": "墨迹",
      "location": "故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "纯粹晋美，清雅不俗。"
    },
    {
      "id": "xing_009",
      "name": "土母帖",
      "aliases": [
        "土母帖"
      ],
      "script_type": "行书",
      "author": "李建中",
      "dynasty": "北宋",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "淳朴自然，近人可学。"
    },
    {
      "id": "xing_010",
      "name": "洛神赋",
      "aliases": [
        "洛神赋",
        "洛神賦"
      ],
      "script_type": "行书",
      "author": "赵孟頫",
      "dynasty": "元",
      "year": "",
      "type": "墨迹",
      "location": "天津博物館 / 故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "华丽典雅，赵体之范。"
    },
    {
      "id": "xing_011",
      "name": "苕溪诗帖",
      "aliases": [
        "苕溪诗帖",
        "苕溪詩帖"
      ],
      "script_type": "行书",
      "author": "米芾",
      "dynasty": "北宋",
      "year": "",
      "type": "墨迹",
      "location": "故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "神采奕奕，行气纵横。"
    },
    {
      "id": "xing_012",
      "name": "平复帖",
      "aliases": [
        "平复帖",
        "平復帖"
      ],
      "script_type": "草书",
      "author": "陆机",
      "dynasty": "西晋",
      "year": "",
      "type": "墨迹",
      "location": "故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "苍茫神妙，章草与行意相接。"
    },
    {
      "id": "xing_013",
      "name": "中秋帖",
      "aliases": [
        "中秋帖",
        "中秋帖"
      ],
      "script_type": "行书",
      "author": "王献之（传）",
      "dynasty": "东晋",
      "year": "",
      "type": "墨迹",
      "location": "故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "奔腾跳跃，行草之神。"
    },
    {
      "id": "cao_001",
      "name": "书谱",
      "aliases": [
        "书谱",
        "書譜"
      ],
      "script_type": "草书",
      "author": "孙过庭",
      "dynasty": "唐",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "智巧兼优，论书与草法并传。"
    },
    {
      "id": "cao_002",
      "name": "自叙帖",
      "aliases": [
        "自叙帖",
        "自敘帖"
      ],
      "script_type": "草书",
      "author": "怀素",
      "dynasty": "唐",
      "year": "",
      "type": "墨迹",
      "location": "台北故宮博物院",
      "total_chars": 0,
      "content": "",
      "description": "骤雨旋风，狂草长卷代表作。"
    },
    {
      "id": "cao_003",
      "name": "十七帖",
      "aliases": [
        "十七帖"
      ],
      "script_type": "草书",
      "author": "王羲之",
      "dynasty": "东晋",
      "year": "",
      "type": "刻帖",
      "location": "西安碑林博物館（拓本）",
      "total_chars": 0,
      "content": "",
      "description": "雅致纯粹，草书刻帖之祖。"
    },
    {
      "id": "cao_004",
      "name": "古诗四帖",
      "aliases": [
        "古诗四帖",
        "古詩四帖"
      ],
      "script_type": "草书",
      "author": "张旭",
      "dynasty": "唐",
      "year": "",
      "type": "墨迹",
      "location": "遼寧省博物館",
      "total_chars": 0,
      "content": "",
      "description": "颠狂之境，狂草巅峰。"
    },
    {
      "id": "cao_005",
      "name": "肚痛帖",
      "aliases": [
        "肚痛帖"
      ],
      "script_type": "草书",
      "author": "张旭",
      "dynasty": "唐",
      "year": "",
      "type": "刻帖",
      "location": "西安碑林博物館（拓本）",
      "total_chars": 0,
      "content": "",
      "description": "神鬼莫测，一气呵成。"
    },
    {
      "id": "cao_006",
      "name": "苦笋帖",
      "aliases": [
        "苦笋帖",
        "苦筍帖"
      ],
      "script_type": "草书",
      "author": "怀素",
      "dynasty": "唐",
      "year": "",
      "type": "墨迹",
      "location": "上海博物館",
      "total_chars": 0,
      "content": "",
      "description": "清俊散淡，尺牍见真章。"
    },
    {
      "id": "cao_007",
      "name": "初月帖",
      "aliases": [
        "初月帖",
        "初月帖"
      ],
      "script_type": "草书",
      "author": "王羲之",
      "dynasty": "东晋",
      "year": "",
      "type": "刻帖",
      "location": "遼寧省博物館（拓本）",
      "total_chars": 0,
      "content": "",
      "description": "神采焕发，晋人风神在此。"
    },
    {
      "id": "zhe_001",
      "name": "天发神谶碑",
      "aliases": [
        "天发神谶碑",
        "天發神讖碑"
      ],
      "script_type": "隶书",
      "author": "不可考",
      "dynasty": "三国/吴",
      "year": "",
      "type": "碑刻",
      "location": "江蘇南京（毀）現存拓本",
      "total_chars": 0,
      "content": "",
      "description": "奇诡壮美，以隶法写篆意。"
    }
  ]
}
