{
  "lines": {
    "cao_001": "智巧兼优，论书与草法并传。",
    "cao_002": "骤雨旋风，狂草长卷代表作。",
    "cao_003": "雅致纯粹，草书刻帖之祖。",
    "cao_004": "颠狂之境，狂草巅峰。",
    "cao_005": "神鬼莫测，一气呵成。",
    "cao_006": "清俊散淡，尺牍见真章。",
    "cao_007": "神采焕发，晋人风神在此。",
    "kai_001": "其清若镜，味甘如醴，南注丹霄之右，东流度于双阙，贯穿青琐，萦带紫房，激扬清波，涤荡瑕秽，可以导养正性，可以澄莹心神。",
    "kai_002": "禅师以大乘为心，小乘为迹，定慧双运，戒忍俱修，讲肆宣阐，法轮常转，故能化行帝里，道被王城，德动天心，名高物表。",
    "kai_004": "战国有率烛、烛孙秦有芝贞，汉有异肆、肆孙钦，钦从祖沛国相盛，始居长安，盛裔孙御。",
    "kai_005": "父讳思鲁，博学善属文，尤工诂训，仕隋司经校书、东宫学士，率更令欧阳询见而叹曰：秘书自有英主，因此遂名。",
    "kai_006": "门人苾萏、如岩、灵悟、净真、真空、法济等，以定慧为文质，以戒忍为刚柔，含朴玉之光辉，等旃檀之围绕。",
    "kai_007": "江南西道都团练、观察处置等使，朝散大夫、检校左散骑常侍兼洪州刺史、御史中丞、上柱国、赐紫金鱼袋裴休撰。",
    "kai_008": "皇帝惕然自思，退而谓群臣曰：历观三五已降致理之君，何常不满招损，谦受益，崇太素，乐无为，宗易简以临人，保慈俭以育物。",
    "kai_009": "爰自所历之国，总将三藏要文，凡六百五十七部，译布中夏，宣扬胜业。",
    "kai_010": "夫其道也，固以孕育陶钧，苞含造化，岂直席卷八代，并吞九邱而已哉。",
    "kai_011": "惟开皇十七年岁次丁巳十月甲辰朔十二日乙卯，上柱国益州总管蜀王制。",
    "kai_012": "七世祖素，轨之第三子，晋明帝太宁中，临羌都尉平西将军西海晋昌金城武威四郡太守，遂家武威。",
    "kai_013": "魏故中书令秘书监使持节督兖州诸军事安东将军兖州刺史南阳郑文公之碑。",
    "kai_014": "其中《始平公造像记》为阳刻，其余为阴刻，风格各异，体现了北魏时期书法的多样性和创造性。",
    "kai_015": "乃裹以玄黄之巾，藏乎兹山之下，仙家无隐晦之志，我等故立石旌事篆铭不朽词曰：相此胎禽，浮丘之真，山阴降迹，华表留声。",
    "kai_016": "武宗皇帝、皇伯晋王及今皇帝、皇太后皆从受戒法，下至诸王将相贵人，委重宝为施身，执弟子礼，不可胜纪。",
    "kai_017": "尔乃众灵杂沓，命俦啸侣，或戏清流，或翔神渚，或采明珠，或拾翠羽。",
    "kai_019": "是以圣人处无为之事，行不言之教，万物作焉而不辞，生而不有，为而不恃，功成而弗居。",
    "kai_020": "六甲灵飞，八景上清。玄宫玉晨，总御众灵。金书紫字，玉文丹…",
    "kai_021": "寄蜉蝣于天地，渺沧海之一粟。",
    "li_001": "君讳全字景完敦煌效谷人也其先盖周之胄武王秉乾之机翦伐殷商…",
    "li_002": "君于是造立礼器，乐之音符，钟磬瑟䜵，雷洗觞觚，爵鹿柤梪，笾柉禁壶，修饰宅庙，更作二舆，朝车威熹。",
    "li_003": "司徒雄、司空戒稽首言：鲁前相瑛书言，诏书崇圣道，勉艺成，孔子作春秋，制孝经，演易，系辞，经纬天地，幽赞神明，故特立庙。",
    "li_004": "文景之间，有张释之，建忠弼之谟，帝游上林，问禽狩所有，苑令不对，更问啬夫，啬夫事对，于是进啬夫为令，令退为啬夫。",
    "li_005": "明明天子，俊德烈烈，稷契伊周，实惟良辅，宏济大化，守彼一隅，晏平西土，会于孟津，述职纳贡，莫敢不来，王命是将，无思不服。",
    "li_006": "惟光和二年，有诏遣骑都尉边让、泰山太守仇审，以闰月廿三日甲子，祭告于华阴。",
    "li_007": "建宁二年，三月癸卯朔，七日己酉，鲁相臣晨、长史臣谦，顿首死罪，上尚书：臣晨顿首顿首，死罪死罪。",
    "li_008": "于是故吏门生，相与立碑，刊石纪功，以垂后世。",
    "li_009": "故吏从事秦鲜等，感君恩德，刊石立碑，以纪休烈。",
    "li_010": "其先出自殷汤，防叔奔鲁，阙里定居，圣哲挺生，祖述宪章。",
    "li_011": "于是故吏门生，相与立碑，刊石纪功，以垂后世。",
    "li_012": "故吏从事李谦等，感念旧恩，刊石立碑，以纪明德。",
    "li_013": "惟光和二年，有诏遣使者，以闰月廿三日甲子，祭告于城隍。",
    "li_014": "惟永寿三年，有诏遣使，以四月庚子朔廿八日丁卯，祭封龙山。",
    "li_015": "五凤二年，鲁卅四年六月四日成。",
    "li_016": "始建国元年，莱子侯某，辟封于食，临老归乡里，为支人刻画。",
    "li_017": "赵廿二年八月丙寅，群臣上酬，此石北。",
    "li_019": "用笔圆浑厚重，结体宽博大气，章法疏朗有致，被誉为清代隶书大家。",
    "li_020": "金农亦擅画竹、梅、鞍马、佛像、人物、山水，尤以墨梅见长，为清代画坛重要人物。",
    "li_180": "其隶书风格独特，横画肥而有骨，竖画劲而能拙，波磔分明而含蓄，结构宽博而紧密。",
    "xing_001": "后之视今，亦犹今之视昔。",
    "xing_002": "壮烈之美，情真笔亦真。",
    "xing_003": "文人之心，笔里有风雨。",
    "xing_004": "典雅极致，唐代集字之极则。",
    "xing_005": "风樯阵马，米芾行书巅峰。",
    "xing_006": "老干发青，骨力苍劲。",
    "xing_007": "清逸淡远，尺牍之雅。",
    "xing_008": "纯粹晋美，清雅不俗。",
    "xing_009": "淳朴自然，近人可学。",
    "xing_010": "华丽典雅，赵体之范。",
    "xing_011": "神采奕奕，行气纵横。",
    "xing_012": "苍茫神妙，章草与行意相接。",
    "xing_013": "奔腾跳跃，行草之神。",
    "zhe_001": "奇诡壮美，以隶法写篆意。",
    "zhuan_001": "今袭号而金石刻辞不称始皇帝，其于久远也，如后嗣为之者，不称成功盛德。",
    "zhuan_002": "维廿八年，皇帝作始。端平法度，万物之纪。以明人事，合同父…",
    "zhuan_003": "乃今皇帝一家天下，兵不复起。",
    "zhuan_004": "暴虐恣行，负力而骄，数动甲兵。",
    "zhuan_005": "唯天将集厥命，亦唯先正略又劂辟，属谨大命，肆皇天亡，临保我有周，丕巩先王配命，旻天疾威，嗣余小子弗役邦，将曷吉。",
    "zhuan_006": "正履夨舍散田：司土逆寅、司马单、人司工君、宰德父，散人小子履田：戎、（微）父、教父、襄之有司橐、州、修从，凡散有司十夫。",
    "zhuan_007": "搏伐猃狁，于洛之阳，折首五百，执讯五十，是以先行。",
    "zhuan_008": "隹匍穆王，井帅宇诲，宁天子，天子，文武长烈，天子眉无匃，繄祁上下，亟熙慕，吴，亡昊。",
    "zhuan_009": "王若曰：盂，丕显文王受天有大命，在武王嗣文王作邦，辟厥匿，匍有四方，畯正厥民。",
    "zhuan_010": "王若曰：颂，命汝官司成周贮廿家，监司新造，贮用宫御。",
    "zhuan_011": "今余唯申先王命，令汝官司邑人，师氏，司治王妾，并附庸田土，赏罚，用既，勿废朕命。",
    "zhuan_012": "唯天将集厥命，亦唯先正略又劂辟，属谨大命，肆皇天亡，临保我有周，丕巩先王配命，旻天疾威，嗣余小子弗役邦，将曷吉。",
    "zhuan_013": "丙午，王赏戍嗣子贝廿朋，在阑□。",
    "zhuan_014": "辛未，王在阑师，赐有事利金，用作檀公宝尊彝。",
    "zhuan_015": "甲骨文是中国最早的成熟文字系统，对研究商代历史和汉字发展具有重要价值。",
    "zhuan_016": "司母戊。",
    "zhuan_017": "丙午，王赏邲其贝廿朋，在四祀。",
    "zhuan_018": "吾以郪于原，吾止陇宫。",
    "zhuan_019": "邓石如篆书成就极高，打破了自唐以来篆书的僵化局面，开创了篆书的新风格。",
    "zhuan_020": "其艺术成就不仅在于书法，更在于将诗书画印融为一体，开创了海派艺术的新局面。"
  }
}
